cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/************************   DFSDM module registers  ****************************/

/********************  Bit definition for DFSDM_CR1 register *******************/
#define  DFSDM_CR1_AWFSEL                     ((uint32_t)0x40000000)            /*!< Analog watchdog fast mode select */
#define  DFSDM_CR1_FAST                       ((uint32_t)0x20000000)            /*!< Fast conversion mode selection */
#define  DFSDM_CR1_RCH                        ((uint32_t)0x07000000)            /*!< RCH[2:0] Regular channel selection */
#define  DFSDM_CR1_RDMAEN                     ((uint32_t)0x00200000)            /*!< DMA channel enabled to read data for the regular conversion */
#define  DFSDM_CR1_RSYNC                      ((uint32_t)0x00080000)            /*!< Launch regular conversion synchronously with DFSDMx */
#define  DFSDM_CR1_RCONT                      ((uint32_t)0x00040000)            /*!< Continuous mode selection for regular conversions */
#define  DFSDM_CR1_RSWSTART                   ((uint32_t)0x00020000)            /*!< Software start of a conversion on the regular channel */
#define  DFSDM_CR1_JEXTEN                     ((uint32_t)0x00006000)            /*!< JEXTEN[1:0] Trigger enable and trigger edge selection for injected conversions */
#define  DFSDM_CR1_JEXTSEL                    ((uint32_t)0x00000700)            /*!< JEXTSEL[2:0]Trigger signal selection for launching injected conversions */
#define  DFSDM_CR1_JDMAEN                     ((uint32_t)0x00000020)            /*!< DMA channel enabled to read data for the injected channel group */
#define  DFSDM_CR1_JSCAN                      ((uint32_t)0x00000010)            /*!< Scanning conversion in continuous mode selection for injected conversions */
#define  DFSDM_CR1_JSYNC                      ((uint32_t)0x00000008)            /*!< Launch an injected conversion synchronously with DFSDMx JSWSTART trigger  */
#define  DFSDM_CR1_JSWSTART                   ((uint32_t)0x00000002)            /*!< Start the conversion of the injected group of channels */
#define  DFSDM_CR1_DFEN                       ((uint32_t)0x00000001)            /*!< DFSDM enable */

/********************  Bit definition for DFSDM_CR2 register *******************/
#define  DFSDM_CR2_AWDCH                      ((uint32_t)0x00FF0000)            /*!< AWDCH[7:0] Analog watchdog channel selection */
#define  DFSDM_CR2_EXCH                       ((uint32_t)0x0000FF00)            /*!< EXCH[7:0] Extreme detector channel selection */
#define  DFSDM_CR2_CKABIE                     ((uint32_t)0x00000040)            /*!< Clock absence interrupt enable */
#define  DFSDM_CR2_SCDIE                      ((uint32_t)0x00000020)            /*!< Short circuit detector interrupt enable */
#define  DFSDM_CR2_AWDIE                      ((uint32_t)0x00000010)            /*!< Analog watchdog interrupt enable */
#define  DFSDM_CR2_ROVRIE                     ((uint32_t)0x00000008)            /*!< Regular data overrun interrupt enable */
#define  DFSDM_CR2_JOVRIE                     ((uint32_t)0x00000004)            /*!< Injected data overrun interrupt enable */
#define  DFSDM_CR2_REOCIE                     ((uint32_t)0x00000002)            /*!< Regular end of conversion interrupt enable */
#define  DFSDM_CR2_JEOCIE                     ((uint32_t)0x00000001)            /*!< Injected end of conversion interrupt enable */

/********************  Bit definition for DFSDM_ISR register *******************/
#define  DFSDM_ISR_SCDF                       ((uint32_t)0xFF000000)            /*!< SCDF[7:0] Short circuit detector flag */
#define  DFSDM_ISR_CKABF                      ((uint32_t)0x00FF0000)            /*!< CKABF[7:0] Clock absence flag */
#define  DFSDM_ISR_RCIP                       ((uint32_t)0x00004000)            /*!< Regular conversion in progress status */
#define  DFSDM_ISR_JCIP                       ((uint32_t)0x00002000)            /*!< Injected conversion in progress status */
#define  DFSDM_ISR_AWDF                       ((uint32_t)0x00000010)            /*!< Analog watchdog */
#define  DFSDM_ISR_ROVRF                      ((uint32_t)0x00000008)            /*!< Regular conversion overrun flag */
#define  DFSDM_ISR_JOVRF                      ((uint32_t)0x00000004)            /*!< Injected conversion overrun flag */
#define  DFSDM_ISR_REOCF                      ((uint32_t)0x00000002)            /*!< End of regular conversion flag */
#define  DFSDM_ISR_JEOCF                      ((uint32_t)0x00000001)            /*!< End of injected conversion flag */

/********************  Bit definition for DFSDM_ICR register *******************/
#define  DFSDM_ICR_CLRSCSDF                   ((uint32_t)0xFF000000)            /*!< CLRSCSDF[7:0] Clear the short circuit detector flag */
#define  DFSDM_ICR_CLRCKABF                   ((uint32_t)0x00FF0000)            /*!< CLRCKABF[7:0] Clear the clock absence flag */
#define  DFSDM_ICR_CLRROVRF                   ((uint32_t)0x00000008)            /*!< Clear the regular conversion overrun flag */
#define  DFSDM_ICR_CLRJOVRF                   ((uint32_t)0x00000004)            /*!< Clear the injected conversion overrun flag */

/*******************  Bit definition for DFSDM_JCHGR register ******************/
#define  DFSDM_JCHGR_JCHG                     ((uint32_t)0x000000FF)            /*!< JCHG[7:0] Injected channel group selection */

/********************  Bit definition for DFSDM_FCR register *******************/
#define  DFSDM_FCR_FORD                       ((uint32_t)0xE0000000)            /*!< FORD[2:0] Sinc filter order */
#define  DFSDM_FCR_FOSR                       ((uint32_t)0x03FF0000)            /*!< FOSR[9:0] Sinc filter oversampling ratio (decimation rate) */
#define  DFSDM_FCR_IOSR                       ((uint32_t)0x000000FF)            /*!< IOSR[7:0] Integrator oversampling ratio (averaging length) */

/******************  Bit definition for DFSDM_JDATAR register *****************/
#define  DFSDM_JDATAR_JDATA                   ((uint32_t)0xFFFFFF00)            /*!< JDATA[23:0] Injected group conversion data */
#define  DFSDM_JDATAR_JDATACH                 ((uint32_t)0x00000007)            /*!< JDATACH[2:0] Injected channel most recently converted */

/******************  Bit definition for DFSDM_RDATAR register *****************/
#define  DFSDM_JDATAR_RDATA                   ((uint32_t)0xFFFFFF00)            /*!< JDATA[23:0] Regular channel conversion data */
#define  DFSDM_JDATAR_RPEND                   ((uint32_t)0x00000010)            /*!< RPEND Regular channel pending data */

/******************  Bit definition for DFSDM_AWHTR register ******************/
#define  DFSDM_AWHTR_AWHT                    ((uint32_t)0xFFFFFF00)             /*!< AWHT[23:0] Analog watchdog high threshold */
#define  DFSDM_AWHTR_BKAWH                   ((uint32_t)0x0000000F)             /*!< BKAWH[3:0] Break signal assignment to analog watchdog high threshold event */

/******************  Bit definition for DFSDM_AWLTR register ******************/
#define  DFSDM_AWLTR_AWLT                    ((uint32_t)0xFFFFFF00)             /*!< AWHT[23:0] Analog watchdog low threshold */
#define  DFSDM_AWLTR_BKAWL                   ((uint32_t)0x0000000F)             /*!< BKAWL[3:0] Break signal assignment to analog watchdog low threshold event */

/******************  Bit definition for DFSDM_AWSR register ******************/
#define  DFSDM_AWSR_AWHTF                    ((uint32_t)0x0000FF00)             /*!< AWHTF[15:8] Analog watchdog high threshold error on given channels */
#define  DFSDM_AWSR_AWLTF                    ((uint32_t)0x000000FF)             /*!< AWLTF[7:0] Analog watchdog low threshold error on given channels */

/******************  Bit definition for DFSDM_AWCFR) register *****************/
#define  DFSDM_EXMAX_CLRAWHTF                ((uint32_t)0x0000FF00)             /*!< CLRAWHTF[15:8] Clear the Analog watchdog high threshold flag */
#define  DFSDM_EXMAX_CLRAWLTF                ((uint32_t)0x000000FF)             /*!< CLRAWLTF[7:0] Clear the Analog watchdog low threshold flag */

/******************  Bit definition for DFSDM_EXMAX register ******************/
#define  DFSDM_EXMAX_EXMAX                   ((uint32_t)0xFFFFFF00)             /*!< EXMAX[23:0] Extreme detector maximum value */
#define  DFSDM_EXMAX_EXMAXCH                 ((uint32_t)0x00000007)             /*!< EXMAXCH[2:0] Extreme detector maximum data channel */

/******************  Bit definition for DFSDM_EXMIN register ******************/
#define  DFSDM_EXMIN_EXMIN                   ((uint32_t)0xFFFFFF00)             /*!< EXMIN[23:0] Extreme detector minimum value */
#define  DFSDM_EXMIN_EXMINCH                 ((uint32_t)0x00000007)             /*!< EXMINCH[2:0] Extreme detector minimum data channel */

/******************  Bit definition for DFSDM_EXMIN register ******************/
#define  DFSDM_CNVTIMR_CNVCNT                ((uint32_t)0xFFFFFFF0)             /*!< CNVCNT[27:0]: 28-bit timer counting conversion time */

/******************************************************************************/
/*                                                                            */
/*                           GPDMA1 Controller                                */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for DMA_ISR register  ********************/
#define  GPDMA1_ISR_GIF0                        ((uint32_t)0x00000001)        /*!< Channel 0 Global interrupt flag */
#define  GPDMA1_ISR_TCIF0                       ((uint32_t)0x00000002)        /*!< Channel 0 Transfer Complete flag */
#define  GPDMA1_ISR_HTIF0                       ((uint32_t)0x00000004)        /*!< Channel 0 Half Transfer flag */
#define  GPDMA1_ISR_TEIF0                       ((uint32_t)0x00000008)        /*!< Channel 0 Transfer Error flag */
#define  GPDMA1_ISR_GIF1                        ((uint32_t)0x00000010)        /*!< Channel 1 Global interrupt flag */
#define  GPDMA1_ISR_TCIF1                       ((uint32_t)0x00000020)        /*!< Channel 1 Transfer Complete flag */
#define  GPDMA1_ISR_HTIF1                       ((uint32_t)0x00000040)        /*!< Channel 1 Half Transfer flag */
#define  GPDMA1_ISR_TEIF1                       ((uint32_t)0x00000080)        /*!< Channel 1 Transfer Error flag */
#define  GPDMA1_ISR_GIF2                        ((uint32_t)0x00000100)        /*!< Channel 2 Global interrupt flag */
#define  GPDMA1_ISR_TCIF2                       ((uint32_t)0x00000200)        /*!< Channel 2 Transfer Complete flag */
#define  GPDMA1_ISR_HTIF2                       ((uint32_t)0x00000400)        /*!< Channel 2 Half Transfer flag */
#define  GPDMA1_ISR_TEIF2                       ((uint32_t)0x00000800)        /*!< Channel 2 Transfer Error flag */
#define  GPDMA1_ISR_GIF3                        ((uint32_t)0x00001000)        /*!< Channel 3 Global interrupt flag */
#define  GPDMA1_ISR_TCIF3                       ((uint32_t)0x00002000)        /*!< Channel 3 Transfer Complete flag */
#define  GPDMA1_ISR_HTIF3                       ((uint32_t)0x00004000)        /*!< Channel 3 Half Transfer flag */
#define  GPDMA1_ISR_TEIF3                       ((uint32_t)0x00008000)        /*!< Channel 3 Transfer Error flag */
#define  GPDMA1_ISR_GIF4                        ((uint32_t)0x00010000)        /*!< Channel 4 Global interrupt flag */
#define  GPDMA1_ISR_TCIF4                       ((uint32_t)0x00020000)        /*!< Channel 4 Transfer Complete flag */
#define  GPDMA1_ISR_HTIF4                       ((uint32_t)0x00040000)        /*!< Channel 4 Half Transfer flag */
#define  GPDMA1_ISR_TEIF4                       ((uint32_t)0x00080000)        /*!< Channel 4 Transfer Error flag */
#define  GPDMA1_ISR_GIF5                        ((uint32_t)0x00100000)        /*!< Channel 5 Global interrupt flag */
#define  GPDMA1_ISR_TCIF5                       ((uint32_t)0x00200000)        /*!< Channel 5 Transfer Complete flag */
#define  GPDMA1_ISR_HTIF5                       ((uint32_t)0x00400000)        /*!< Channel 5 Half Transfer flag */
#define  GPDMA1_ISR_TEIF5                       ((uint32_t)0x00800000)        /*!< Channel 5 Transfer Error flag */
#define  GPDMA1_ISR_GIF6                        ((uint32_t)0x01000000)        /*!< Channel 6 Global interrupt flag */
#define  GPDMA1_ISR_TCIF6                       ((uint32_t)0x02000000)        /*!< Channel 6 Transfer Complete flag */
#define  GPDMA1_ISR_HTIF6                       ((uint32_t)0x04000000)        /*!< Channel 6 Half Transfer flag */
#define  GPDMA1_ISR_TEIF6                       ((uint32_t)0x08000000)        /*!< Channel 6 Transfer Error flag */
#define  GPDMA1_ISR_GIF7                        ((uint32_t)0x10000000)        /*!< Channel 7 Global interrupt flag */
#define  GPDMA1_ISR_TCIF7                       ((uint32_t)0x20000000)        /*!< Channel 7 Transfer Complete flag */
#define  GPDMA1_ISR_HTIF7                       ((uint32_t)0x40000000)        /*!< Channel 7 Half Transfer flag */
#define  GPDMA1_ISR_TEIF7                       ((uint32_t)0x80000000)        /*!< Channel 7 Transfer Error flag */

