cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/*******************  Bit definition for DMA_IFCR register  *******************/
#define  GPDMA1_IFCR_CGIF0                      ((uint32_t)0x00000001)        /*!< Channel 0 Global interrupt clearr */
#define  GPDMA1_IFCR_CTCIF0                     ((uint32_t)0x00000002)        /*!< Channel 0 Transfer Complete clear */
#define  GPDMA1_IFCR_CHTIF0                     ((uint32_t)0x00000004)        /*!< Channel 0 Half Transfer clear */
#define  GPDMA1_IFCR_CTEIF0                     ((uint32_t)0x00000008)        /*!< Channel 0 Transfer Error clear */
#define  GPDMA1_IFCR_CGIF1                      ((uint32_t)0x00000010)        /*!< Channel 1 Global interrupt clear */
#define  GPDMA1_IFCR_CTCIF1                     ((uint32_t)0x00000020)        /*!< Channel 1 Transfer Complete clear */
#define  GPDMA1_IFCR_CHTIF1                     ((uint32_t)0x00000040)        /*!< Channel 1 Half Transfer clear */
#define  GPDMA1_IFCR_CTEIF1                     ((uint32_t)0x00000080)        /*!< Channel 1 Transfer Error clear */
#define  GPDMA1_IFCR_CGIF2                      ((uint32_t)0x00000100)        /*!< Channel 2 Global interrupt clear */
#define  GPDMA1_IFCR_CTCIF2                     ((uint32_t)0x00000200)        /*!< Channel 2 Transfer Complete clear */
#define  GPDMA1_IFCR_CHTIF2                     ((uint32_t)0x00000400)        /*!< Channel 2 Half Transfer clear */
#define  GPDMA1_IFCR_CTEIF2                     ((uint32_t)0x00000800)        /*!< Channel 2 Transfer Error clear */
#define  GPDMA1_IFCR_CGIF3                      ((uint32_t)0x00001000)        /*!< Channel 3 Global interrupt clear */
#define  GPDMA1_IFCR_CTCIF3                     ((uint32_t)0x00002000)        /*!< Channel 3 Transfer Complete clear */
#define  GPDMA1_IFCR_CHTIF3                     ((uint32_t)0x00004000)        /*!< Channel 3 Half Transfer clear */
#define  GPDMA1_IFCR_CTEIF3                     ((uint32_t)0x00008000)        /*!< Channel 3 Transfer Error clear */
#define  GPDMA1_IFCR_CGIF4                      ((uint32_t)0x00010000)        /*!< Channel 4 Global interrupt clear */
#define  GPDMA1_IFCR_CTCIF4                     ((uint32_t)0x00020000)        /*!< Channel 4 Transfer Complete clear */
#define  GPDMA1_IFCR_CHTIF4                     ((uint32_t)0x00040000)        /*!< Channel 4 Half Transfer clear */
#define  GPDMA1_IFCR_CTEIF4                     ((uint32_t)0x00080000)        /*!< Channel 4 Transfer Error clear */
#define  GPDMA1_IFCR_CGIF5                      ((uint32_t)0x00100000)        /*!< Channel 5 Global interrupt clear */
#define  GPDMA1_IFCR_CTCIF5                     ((uint32_t)0x00200000)        /*!< Channel 5 Transfer Complete clear */
#define  GPDMA1_IFCR_CHTIF5                     ((uint32_t)0x00400000)        /*!< Channel 5 Half Transfer clear */
#define  GPDMA1_IFCR_CTEIF5                     ((uint32_t)0x00800000)        /*!< Channel 5 Transfer Error clear */
#define  GPDMA1_IFCR_CGIF6                      ((uint32_t)0x01000000)        /*!< Channel 6 Global interrupt clear */
#define  GPDMA1_IFCR_CTCIF6                     ((uint32_t)0x02000000)        /*!< Channel 6 Transfer Complete clear */
#define  GPDMA1_IFCR_CHTIF6                     ((uint32_t)0x04000000)        /*!< Channel 6 Half Transfer clear */
#define  GPDMA1_IFCR_CTEIF6                     ((uint32_t)0x08000000)        /*!< Channel 6 Transfer Error clear */
#define  GPDMA1_IFCR_CGIF7                      ((uint32_t)0x10000000)        /*!< Channel 7 Global interrupt clear */
#define  GPDMA1_IFCR_CTCIF7                     ((uint32_t)0x20000000)        /*!< Channel 7 Transfer Complete clear */
#define  GPDMA1_IFCR_CHTIF7                     ((uint32_t)0x40000000)        /*!< Channel 7 Half Transfer clear */
#define  GPDMA1_IFCR_CTEIF7                     ((uint32_t)0x80000000)        /*!< Channel 7 Transfer Error clear */

/*******************  Bit definition for DMA_CCR register  ********************/
#define  GPDMA1_CCR_EN                          ((uint32_t)0x00000001)        /*!< Channel enable                      */
#define  GPDMA1_CCR_TCIE                        ((uint32_t)0x00000002)        /*!< Transfer complete interrupt enable  */
#define  GPDMA1_CCR_HTIE                        ((uint32_t)0x00000004)        /*!< Half Transfer interrupt enable      */
#define  GPDMA1_CCR_TEIE                        ((uint32_t)0x00000008)        /*!< Transfer error interrupt enable     */
#define  GPDMA1_CCR_DIR                         ((uint32_t)0x00000010)        /*!< Data transfer direction             */
#define  GPDMA1_CCR_CIRC                        ((uint32_t)0x00000020)        /*!< Circular mode                       */
#define  GPDMA1_CCR_PINC                        ((uint32_t)0x00000040)        /*!< Peripheral increment mode           */
#define  GPDMA1_CCR_MINC                        ((uint32_t)0x00000080)        /*!< Memory increment mode               */

#define  GPDMA1_CCR_PSIZE                       ((uint32_t)0x00000300)        /*!< PSIZE[1:0] bits (Peripheral size)   */
#define  GPDMA1_CCR_PSIZE_0                     ((uint32_t)0x00000100)        /*!< Bit 0                               */
#define  GPDMA1_CCR_PSIZE_1                     ((uint32_t)0x00000200)        /*!< Bit 1                               */

#define  GPDMA1_CCR_MSIZE                       ((uint32_t)0x00000C00)        /*!< MSIZE[1:0] bits (Memory size)       */
#define  GPDMA1_CCR_MSIZE_0                     ((uint32_t)0x00000400)        /*!< Bit 0                               */
#define  GPDMA1_CCR_MSIZE_1                     ((uint32_t)0x00000800)        /*!< Bit 1                               */

#define  GPDMA1_CCR_PL                          ((uint32_t)0x00003000)        /*!< PL[1:0] bits(Channel Priority level)*/
#define  GPDMA1_CCR_PL_0                        ((uint32_t)0x00001000)        /*!< Bit 0                               */
#define  GPDMA1_CCR_PL_1                        ((uint32_t)0x00002000)        /*!< Bit 1                               */

