cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
#define  GPDMA1_CCR_MEM2MEM                     ((uint32_t)0x00004000)        /*!< Memory to memory mode               */

/******************  Bit definition for DMA_CNDTR register  *******************/
#define  GPDMA1_CNDTR_NDT                       ((uint32_t)0x0000FFFF)        /*!< Number of data to Transfer          */

/******************  Bit definition for DMA_CPAR register  ********************/
#define  GPDMA1_CPAR_PA                         ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address                  */

/******************  Bit definition for DMA_CMAR register  ********************/
#define  GPDMA1_CMAR_MA                         ((uint32_t)0xFFFFFFFF)        /*!< Memory Address                      */

/******************************************************************************/
/*                                                                            */
/*                             GPDMA2 Controller                              */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SxCR register  *****************/ 
#define GPDMA2_SxCR_MBURST                      ((uint32_t)0x01800000)
#define GPDMA2_SxCR_MBURST_0                    ((uint32_t)0x00800000)
#define GPDMA2_SxCR_MBURST_1                    ((uint32_t)0x01000000)
#define GPDMA2_SxCR_PBURST                      ((uint32_t)0x00600000)
#define GPDMA2_SxCR_PBURST_0                    ((uint32_t)0x00200000)
#define GPDMA2_SxCR_PBURST_1                    ((uint32_t)0x00400000)
#define GPDMA2_SxCR_ACK                         ((uint32_t)0x00100000)
#define GPDMA2_SxCR_CT                          ((uint32_t)0x00080000)  
#define GPDMA2_SxCR_DBM                         ((uint32_t)0x00040000)
#define GPDMA2_SxCR_PL                          ((uint32_t)0x00030000)
#define GPDMA2_SxCR_PL_0                        ((uint32_t)0x00010000)
#define GPDMA2_SxCR_PL_1                        ((uint32_t)0x00020000)
#define GPDMA2_SxCR_PINCOS                      ((uint32_t)0x00008000)
#define GPDMA2_SxCR_MSIZE                       ((uint32_t)0x00006000)
#define GPDMA2_SxCR_MSIZE_0                     ((uint32_t)0x00002000)
#define GPDMA2_SxCR_MSIZE_1                     ((uint32_t)0x00004000)
#define GPDMA2_SxCR_PSIZE                       ((uint32_t)0x00001800)
#define GPDMA2_SxCR_PSIZE_0                     ((uint32_t)0x00000800)
#define GPDMA2_SxCR_PSIZE_1                     ((uint32_t)0x00001000)
#define GPDMA2_SxCR_MINC                        ((uint32_t)0x00000400)
#define GPDMA2_SxCR_PINC                        ((uint32_t)0x00000200)
#define GPDMA2_SxCR_CIRC                        ((uint32_t)0x00000100)
#define GPDMA2_SxCR_DIR                         ((uint32_t)0x000000C0)
#define GPDMA2_SxCR_DIR_0                       ((uint32_t)0x00000040)
#define GPDMA2_SxCR_DIR_1                       ((uint32_t)0x00000080)
#define GPDMA2_SxCR_PFCTRL                      ((uint32_t)0x00000020)
#define GPDMA2_SxCR_TCIE                        ((uint32_t)0x00000010)
#define GPDMA2_SxCR_HTIE                        ((uint32_t)0x00000008)
#define GPDMA2_SxCR_TEIE                        ((uint32_t)0x00000004)
#define GPDMA2_SxCR_DMEIE                       ((uint32_t)0x00000002)
#define GPDMA2_SxCR_EN                          ((uint32_t)0x00000001)

/********************  Bits definition for DMA_SxCNDTR register  **************/
#define GPDMA2_SxNDT                            ((uint32_t)0x0000FFFF)
#define GPDMA2_SxNDT_0                          ((uint32_t)0x00000001)
#define GPDMA2_SxNDT_1                          ((uint32_t)0x00000002)
#define GPDMA2_SxNDT_2                          ((uint32_t)0x00000004)
#define GPDMA2_SxNDT_3                          ((uint32_t)0x00000008)
#define GPDMA2_SxNDT_4                          ((uint32_t)0x00000010)
#define GPDMA2_SxNDT_5                          ((uint32_t)0x00000020)
#define GPDMA2_SxNDT_6                          ((uint32_t)0x00000040)
#define GPDMA2_SxNDT_7                          ((uint32_t)0x00000080)
#define GPDMA2_SxNDT_8                          ((uint32_t)0x00000100)
#define GPDMA2_SxNDT_9                          ((uint32_t)0x00000200)
#define GPDMA2_SxNDT_10                         ((uint32_t)0x00000400)
#define GPDMA2_SxNDT_11                         ((uint32_t)0x00000800)
#define GPDMA2_SxNDT_12                         ((uint32_t)0x00001000)
#define GPDMA2_SxNDT_13                         ((uint32_t)0x00002000)
#define GPDMA2_SxNDT_14                         ((uint32_t)0x00004000)
#define GPDMA2_SxNDT_15                         ((uint32_t)0x00008000)

/********************  Bits definition for DMA_SxFCR register  ****************/ 
#define GPDMA2_SxFCR_FEIE                       ((uint32_t)0x00000080)
#define GPDMA2_SxFCR_FS                         ((uint32_t)0x00000038)
#define GPDMA2_SxFCR_FS_0                       ((uint32_t)0x00000008)
#define GPDMA2_SxFCR_FS_1                       ((uint32_t)0x00000010)
#define GPDMA2_SxFCR_FS_2                       ((uint32_t)0x00000020)
#define GPDMA2_SxFCR_DMDIS                      ((uint32_t)0x00000004)
#define GPDMA2_SxFCR_FTH                        ((uint32_t)0x00000003)
#define GPDMA2_SxFCR_FTH_0                      ((uint32_t)0x00000001)
#define GPDMA2_SxFCR_FTH_1                      ((uint32_t)0x00000002)

/********************  Bits definition for DMA_LISR register  *****************/ 
#define GPDMA2_LISR_TCIF3                       ((uint32_t)0x08000000)
#define GPDMA2_LISR_HTIF3                       ((uint32_t)0x04000000)
#define GPDMA2_LISR_TEIF3                       ((uint32_t)0x02000000)
#define GPDMA2_LISR_DMEIF3                      ((uint32_t)0x01000000)
#define GPDMA2_LISR_FEIF3                       ((uint32_t)0x00400000)
#define GPDMA2_LISR_TCIF2                       ((uint32_t)0x00200000)
#define GPDMA2_LISR_HTIF2                       ((uint32_t)0x00100000)
#define GPDMA2_LISR_TEIF2                       ((uint32_t)0x00080000)
#define GPDMA2_LISR_DMEIF2                      ((uint32_t)0x00040000)
#define GPDMA2_LISR_FEIF2                       ((uint32_t)0x00010000)
#define GPDMA2_LISR_TCIF1                       ((uint32_t)0x00000800)
#define GPDMA2_LISR_HTIF1                       ((uint32_t)0x00000400)
#define GPDMA2_LISR_TEIF1                       ((uint32_t)0x00000200)
#define GPDMA2_LISR_DMEIF1                      ((uint32_t)0x00000100)
#define GPDMA2_LISR_FEIF1                       ((uint32_t)0x00000040)
#define GPDMA2_LISR_TCIF0                       ((uint32_t)0x00000020)
#define GPDMA2_LISR_HTIF0                       ((uint32_t)0x00000010)
#define GPDMA2_LISR_TEIF0                       ((uint32_t)0x00000008)
#define GPDMA2_LISR_DMEIF0                      ((uint32_t)0x00000004)
#define GPDMA2_LISR_FEIF0                       ((uint32_t)0x00000001)

