cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/*******************  Bit definition for DSIHOST_VCCR register  ***************/
#define DSIHOST_VCCR_NUMC                  ((uint32_t)0x00001FFF)               /*!< Number of Chunks */
#define DSIHOST_VCCR_NUMC0                 ((uint32_t)0x00000001)
#define DSIHOST_VCCR_NUMC1                 ((uint32_t)0x00000002)
#define DSIHOST_VCCR_NUMC2                 ((uint32_t)0x00000004)
#define DSIHOST_VCCR_NUMC3                 ((uint32_t)0x00000008)
#define DSIHOST_VCCR_NUMC4                 ((uint32_t)0x00000010)
#define DSIHOST_VCCR_NUMC5                 ((uint32_t)0x00000020)
#define DSIHOST_VCCR_NUMC6                 ((uint32_t)0x00000040)
#define DSIHOST_VCCR_NUMC7                 ((uint32_t)0x00000080)
#define DSIHOST_VCCR_NUMC8                 ((uint32_t)0x00000100)
#define DSIHOST_VCCR_NUMC9                 ((uint32_t)0x00000200)
#define DSIHOST_VCCR_NUMC10                ((uint32_t)0x00000400)
#define DSIHOST_VCCR_NUMC11                ((uint32_t)0x00000800)
#define DSIHOST_VCCR_NUMC12                ((uint32_t)0x00001000)

/*******************  Bit definition for DSIHOST_VNPCR register  **************/
#define DSIHOST_VNPCR_NPSIZE               ((uint32_t)0x00001FFF)               /*!< Null Packet Size */
#define DSIHOST_VNPCR_NPSIZE0              ((uint32_t)0x00000001)
#define DSIHOST_VNPCR_NPSIZE1              ((uint32_t)0x00000002)
#define DSIHOST_VNPCR_NPSIZE2              ((uint32_t)0x00000004)
#define DSIHOST_VNPCR_NPSIZE3              ((uint32_t)0x00000008)
#define DSIHOST_VNPCR_NPSIZE4              ((uint32_t)0x00000010)
#define DSIHOST_VNPCR_NPSIZE5              ((uint32_t)0x00000020)
#define DSIHOST_VNPCR_NPSIZE6              ((uint32_t)0x00000040)
#define DSIHOST_VNPCR_NPSIZE7              ((uint32_t)0x00000080)
#define DSIHOST_VNPCR_NPSIZE8              ((uint32_t)0x00000100)
#define DSIHOST_VNPCR_NPSIZE9              ((uint32_t)0x00000200)
#define DSIHOST_VNPCR_NPSIZE10             ((uint32_t)0x00000400)
#define DSIHOST_VNPCR_NPSIZE11             ((uint32_t)0x00000800)
#define DSIHOST_VNPCR_NPSIZE12             ((uint32_t)0x00001000)

/*******************  Bit definition for DSIHOST_VHSACR register  *************/
#define DSIHOST_VHSACR_HSA                 ((uint32_t)0x00000FFF)               /*!< Horizontal Synchronism Active duration */
#define DSIHOST_VHSACR_HSA0                ((uint32_t)0x00000001)
#define DSIHOST_VHSACR_HSA1                ((uint32_t)0x00000002)
#define DSIHOST_VHSACR_HSA2                ((uint32_t)0x00000004)
#define DSIHOST_VHSACR_HSA3                ((uint32_t)0x00000008)
#define DSIHOST_VHSACR_HSA4                ((uint32_t)0x00000010)
#define DSIHOST_VHSACR_HSA5                ((uint32_t)0x00000020)
#define DSIHOST_VHSACR_HSA6                ((uint32_t)0x00000040)
#define DSIHOST_VHSACR_HSA7                ((uint32_t)0x00000080)
#define DSIHOST_VHSACR_HSA8                ((uint32_t)0x00000100)
#define DSIHOST_VHSACR_HSA9                ((uint32_t)0x00000200)
#define DSIHOST_VHSACR_HSA10               ((uint32_t)0x00000400)
#define DSIHOST_VHSACR_HSA11               ((uint32_t)0x00000800)

/*******************  Bit definition for DSIHOST_VHBPCR register  *************/
#define DSIHOST_VHBPCR_HBP                 ((uint32_t)0x00000FFF)               /*!< Horizontal Back-Porch duration */
#define DSIHOST_VHBPCR_HBP0                ((uint32_t)0x00000001)
#define DSIHOST_VHBPCR_HBP1                ((uint32_t)0x00000002)
#define DSIHOST_VHBPCR_HBP2                ((uint32_t)0x00000004)
#define DSIHOST_VHBPCR_HBP3                ((uint32_t)0x00000008)
#define DSIHOST_VHBPCR_HBP4                ((uint32_t)0x00000010)
#define DSIHOST_VHBPCR_HBP5                ((uint32_t)0x00000020)
#define DSIHOST_VHBPCR_HBP6                ((uint32_t)0x00000040)
#define DSIHOST_VHBPCR_HBP7                ((uint32_t)0x00000080)
#define DSIHOST_VHBPCR_HBP8                ((uint32_t)0x00000100)
#define DSIHOST_VHBPCR_HBP9                ((uint32_t)0x00000200)
#define DSIHOST_VHBPCR_HBP10               ((uint32_t)0x00000400)
#define DSIHOST_VHBPCR_HBP11               ((uint32_t)0x00000800)

/*******************  Bit definition for DSIHOST_VLCR register  ***************/
#define DSIHOST_VLCR_HLINE                 ((uint32_t)0x00007FFF)               /*!< Horizontal Line duration */
#define DSIHOST_VLCR_HLINE0                ((uint32_t)0x00000001)
#define DSIHOST_VLCR_HLINE1                ((uint32_t)0x00000002)
#define DSIHOST_VLCR_HLINE2                ((uint32_t)0x00000004)
#define DSIHOST_VLCR_HLINE3                ((uint32_t)0x00000008)
#define DSIHOST_VLCR_HLINE4                ((uint32_t)0x00000010)
#define DSIHOST_VLCR_HLINE5                ((uint32_t)0x00000020)
#define DSIHOST_VLCR_HLINE6                ((uint32_t)0x00000040)
#define DSIHOST_VLCR_HLINE7                ((uint32_t)0x00000080)
#define DSIHOST_VLCR_HLINE8                ((uint32_t)0x00000100)
#define DSIHOST_VLCR_HLINE9                ((uint32_t)0x00000200)
#define DSIHOST_VLCR_HLINE10               ((uint32_t)0x00000400)
#define DSIHOST_VLCR_HLINE11               ((uint32_t)0x00000800)
#define DSIHOST_VLCR_HLINE12               ((uint32_t)0x00001000)
#define DSIHOST_VLCR_HLINE13               ((uint32_t)0x00002000)
#define DSIHOST_VLCR_HLINE14               ((uint32_t)0x00004000)

/*******************  Bit definition for DSIHOST_VVSACR register  *************/
#define DSIHOST_VVSACR_VSA                 ((uint32_t)0x000003FF)               /*!< Vertical Synchronism Active duration */
#define DSIHOST_VVSACR_VSA0                ((uint32_t)0x00000001)
#define DSIHOST_VVSACR_VSA1                ((uint32_t)0x00000002)
#define DSIHOST_VVSACR_VSA2                ((uint32_t)0x00000004)
#define DSIHOST_VVSACR_VSA3                ((uint32_t)0x00000008)
#define DSIHOST_VVSACR_VSA4                ((uint32_t)0x00000010)
#define DSIHOST_VVSACR_VSA5                ((uint32_t)0x00000020)
#define DSIHOST_VVSACR_VSA6                ((uint32_t)0x00000040)
#define DSIHOST_VVSACR_VSA7                ((uint32_t)0x00000080)
#define DSIHOST_VVSACR_VSA8                ((uint32_t)0x00000100)
#define DSIHOST_VVSACR_VSA9                ((uint32_t)0x00000200)

/*******************  Bit definition for DSIHOST_VVBPCR register  *************/
#define DSIHOST_VVBPCR_VBP                 ((uint32_t)0x000003FF)               /*!< Vertical Back-Porch duration */
#define DSIHOST_VVBPCR_VBP0                ((uint32_t)0x00000001)
#define DSIHOST_VVBPCR_VBP1                ((uint32_t)0x00000002)
#define DSIHOST_VVBPCR_VBP2                ((uint32_t)0x00000004)
#define DSIHOST_VVBPCR_VBP3                ((uint32_t)0x00000008)
#define DSIHOST_VVBPCR_VBP4                ((uint32_t)0x00000010)
#define DSIHOST_VVBPCR_VBP5                ((uint32_t)0x00000020)
#define DSIHOST_VVBPCR_VBP6                ((uint32_t)0x00000040)
#define DSIHOST_VVBPCR_VBP7                ((uint32_t)0x00000080)
#define DSIHOST_VVBPCR_VBP8                ((uint32_t)0x00000100)
#define DSIHOST_VVBPCR_VBP9                ((uint32_t)0x00000200)

/*******************  Bit definition for DSIHOST_VVFPCR register  *************/
#define DSIHOST_VVFPCR_VFP                 ((uint32_t)0x000003FF)               /*!< Vertical Front-Porch duration */
#define DSIHOST_VVFPCR_VFP0                ((uint32_t)0x00000001)
#define DSIHOST_VVFPCR_VFP1                ((uint32_t)0x00000002)
#define DSIHOST_VVFPCR_VFP2                ((uint32_t)0x00000004)
#define DSIHOST_VVFPCR_VFP3                ((uint32_t)0x00000008)
#define DSIHOST_VVFPCR_VFP4                ((uint32_t)0x00000010)
#define DSIHOST_VVFPCR_VFP5                ((uint32_t)0x00000020)
#define DSIHOST_VVFPCR_VFP6                ((uint32_t)0x00000040)
#define DSIHOST_VVFPCR_VFP7                ((uint32_t)0x00000080)
#define DSIHOST_VVFPCR_VFP8                ((uint32_t)0x00000100)
#define DSIHOST_VVFPCR_VFP9                ((uint32_t)0x00000200)

/*******************  Bit definition for DSIHOST_VVACR register  **************/
#define DSIHOST_VVACR_VA                   ((uint32_t)0x00003FFF)               /*!< Vertical Active duration */
#define DSIHOST_VVACR_VA0                  ((uint32_t)0x00000001)
#define DSIHOST_VVACR_VA1                  ((uint32_t)0x00000002)
#define DSIHOST_VVACR_VA2                  ((uint32_t)0x00000004)
#define DSIHOST_VVACR_VA3                  ((uint32_t)0x00000008)
#define DSIHOST_VVACR_VA4                  ((uint32_t)0x00000010)
#define DSIHOST_VVACR_VA5                  ((uint32_t)0x00000020)
#define DSIHOST_VVACR_VA6                  ((uint32_t)0x00000040)
#define DSIHOST_VVACR_VA7                  ((uint32_t)0x00000080)
#define DSIHOST_VVACR_VA8                  ((uint32_t)0x00000100)
#define DSIHOST_VVACR_VA9                  ((uint32_t)0x00000200)
#define DSIHOST_VVACR_VA10                 ((uint32_t)0x00000400)
#define DSIHOST_VVACR_VA11                 ((uint32_t)0x00000800)
#define DSIHOST_VVACR_VA12                 ((uint32_t)0x00001000)
#define DSIHOST_VVACR_VA13                 ((uint32_t)0x00002000)

/*******************  Bit definition for DSIHOST_LCCR register  ***************/
#define DSIHOST_LCCR_CMDSIZE               ((uint32_t)0x0000FFFF)               /*!< Command Size */
#define DSIHOST_LCCR_CMDSIZE0              ((uint32_t)0x00000001)
#define DSIHOST_LCCR_CMDSIZE1              ((uint32_t)0x00000002)
#define DSIHOST_LCCR_CMDSIZE2              ((uint32_t)0x00000004)
#define DSIHOST_LCCR_CMDSIZE3              ((uint32_t)0x00000008)
#define DSIHOST_LCCR_CMDSIZE4              ((uint32_t)0x00000010)
#define DSIHOST_LCCR_CMDSIZE5              ((uint32_t)0x00000020)
#define DSIHOST_LCCR_CMDSIZE6              ((uint32_t)0x00000040)
#define DSIHOST_LCCR_CMDSIZE7              ((uint32_t)0x00000080)
#define DSIHOST_LCCR_CMDSIZE8              ((uint32_t)0x00000100)
#define DSIHOST_LCCR_CMDSIZE9              ((uint32_t)0x00000200)
#define DSIHOST_LCCR_CMDSIZE10             ((uint32_t)0x00000400)
#define DSIHOST_LCCR_CMDSIZE11             ((uint32_t)0x00000800)
#define DSIHOST_LCCR_CMDSIZE12             ((uint32_t)0x00001000)
#define DSIHOST_LCCR_CMDSIZE13             ((uint32_t)0x00002000)
#define DSIHOST_LCCR_CMDSIZE14             ((uint32_t)0x00004000)
#define DSIHOST_LCCR_CMDSIZE15             ((uint32_t)0x00008000)

