cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/*******************  Bit definition for DSIHOST_TCCR2 register  **************/
#define DSIHOST_TCCR2_HSRD_TOCNT           ((uint32_t)0x0000FFFF)               /*!< High-Speed Read Timeout Counter */
#define DSIHOST_TCCR2_HSRD_TOCNT0          ((uint32_t)0x00000001)
#define DSIHOST_TCCR2_HSRD_TOCNT1          ((uint32_t)0x00000002)
#define DSIHOST_TCCR2_HSRD_TOCNT2          ((uint32_t)0x00000004)
#define DSIHOST_TCCR2_HSRD_TOCNT3          ((uint32_t)0x00000008)
#define DSIHOST_TCCR2_HSRD_TOCNT4          ((uint32_t)0x00000010)
#define DSIHOST_TCCR2_HSRD_TOCNT5          ((uint32_t)0x00000020)
#define DSIHOST_TCCR2_HSRD_TOCNT6          ((uint32_t)0x00000040)
#define DSIHOST_TCCR2_HSRD_TOCNT7          ((uint32_t)0x00000080)
#define DSIHOST_TCCR2_HSRD_TOCNT8          ((uint32_t)0x00000100)
#define DSIHOST_TCCR2_HSRD_TOCNT9          ((uint32_t)0x00000200)
#define DSIHOST_TCCR2_HSRD_TOCNT10         ((uint32_t)0x00000400)
#define DSIHOST_TCCR2_HSRD_TOCNT11         ((uint32_t)0x00000800)
#define DSIHOST_TCCR2_HSRD_TOCNT12         ((uint32_t)0x00001000)
#define DSIHOST_TCCR2_HSRD_TOCNT13         ((uint32_t)0x00002000)
#define DSIHOST_TCCR2_HSRD_TOCNT14         ((uint32_t)0x00004000)
#define DSIHOST_TCCR2_HSRD_TOCNT15         ((uint32_t)0x00008000)

/*******************  Bit definition for DSIHOST_TCCR3 register  **************/
#define DSIHOST_TCCR3_LPRD_TOCNT           ((uint32_t)0x0000FFFF)               /*!< Low-Power Read Timeout Counter */
#define DSIHOST_TCCR3_LPRD_TOCNT0          ((uint32_t)0x00000001)
#define DSIHOST_TCCR3_LPRD_TOCNT1          ((uint32_t)0x00000002)
#define DSIHOST_TCCR3_LPRD_TOCNT2          ((uint32_t)0x00000004)
#define DSIHOST_TCCR3_LPRD_TOCNT3          ((uint32_t)0x00000008)
#define DSIHOST_TCCR3_LPRD_TOCNT4          ((uint32_t)0x00000010)
#define DSIHOST_TCCR3_LPRD_TOCNT5          ((uint32_t)0x00000020)
#define DSIHOST_TCCR3_LPRD_TOCNT6          ((uint32_t)0x00000040)
#define DSIHOST_TCCR3_LPRD_TOCNT7          ((uint32_t)0x00000080)
#define DSIHOST_TCCR3_LPRD_TOCNT8          ((uint32_t)0x00000100)
#define DSIHOST_TCCR3_LPRD_TOCNT9          ((uint32_t)0x00000200)
#define DSIHOST_TCCR3_LPRD_TOCNT10         ((uint32_t)0x00000400)
#define DSIHOST_TCCR3_LPRD_TOCNT11         ((uint32_t)0x00000800)
#define DSIHOST_TCCR3_LPRD_TOCNT12         ((uint32_t)0x00001000)
#define DSIHOST_TCCR3_LPRD_TOCNT13         ((uint32_t)0x00002000)
#define DSIHOST_TCCR3_LPRD_TOCNT14         ((uint32_t)0x00004000)
#define DSIHOST_TCCR3_LPRD_TOCNT15         ((uint32_t)0x00008000)

/*******************  Bit definition for DSIHOST_TCCR4 register  **************/
#define DSIHOST_TCCR4_HSWR_TOCNT           ((uint32_t)0x0000FFFF)               /*!< High-Speed Write Timeout Counter */
#define DSIHOST_TCCR4_HSWR_TOCNT0          ((uint32_t)0x00000001)
#define DSIHOST_TCCR4_HSWR_TOCNT1          ((uint32_t)0x00000002)
#define DSIHOST_TCCR4_HSWR_TOCNT2          ((uint32_t)0x00000004)
#define DSIHOST_TCCR4_HSWR_TOCNT3          ((uint32_t)0x00000008)
#define DSIHOST_TCCR4_HSWR_TOCNT4          ((uint32_t)0x00000010)
#define DSIHOST_TCCR4_HSWR_TOCNT5          ((uint32_t)0x00000020)
#define DSIHOST_TCCR4_HSWR_TOCNT6          ((uint32_t)0x00000040)
#define DSIHOST_TCCR4_HSWR_TOCNT7          ((uint32_t)0x00000080)
#define DSIHOST_TCCR4_HSWR_TOCNT8          ((uint32_t)0x00000100)
#define DSIHOST_TCCR4_HSWR_TOCNT9          ((uint32_t)0x00000200)
#define DSIHOST_TCCR4_HSWR_TOCNT10         ((uint32_t)0x00000400)
#define DSIHOST_TCCR4_HSWR_TOCNT11         ((uint32_t)0x00000800)
#define DSIHOST_TCCR4_HSWR_TOCNT12         ((uint32_t)0x00001000)
#define DSIHOST_TCCR4_HSWR_TOCNT13         ((uint32_t)0x00002000)
#define DSIHOST_TCCR4_HSWR_TOCNT14         ((uint32_t)0x00004000)
#define DSIHOST_TCCR4_HSWR_TOCNT15         ((uint32_t)0x00008000)

#define DSIHOST_TCCR4_PM                   ((uint32_t)0x01000000)               /*!< Presp Mode */

/*******************  Bit definition for DSIHOST_TCCR5 register  **************/
#define DSIHOST_TCCR5_LSWR_TOCNT           ((uint32_t)0x0000FFFF)               /*!< Low-Speed Write Timeout Counter */
#define DSIHOST_TCCR5_LSWR_TOCNT0          ((uint32_t)0x00000001)
#define DSIHOST_TCCR5_LSWR_TOCNT1          ((uint32_t)0x00000002)
#define DSIHOST_TCCR5_LSWR_TOCNT2          ((uint32_t)0x00000004)
#define DSIHOST_TCCR5_LSWR_TOCNT3          ((uint32_t)0x00000008)
#define DSIHOST_TCCR5_LSWR_TOCNT4          ((uint32_t)0x00000010)
#define DSIHOST_TCCR5_LSWR_TOCNT5          ((uint32_t)0x00000020)
#define DSIHOST_TCCR5_LSWR_TOCNT6          ((uint32_t)0x00000040)
#define DSIHOST_TCCR5_LSWR_TOCNT7          ((uint32_t)0x00000080)
#define DSIHOST_TCCR5_LSWR_TOCNT8          ((uint32_t)0x00000100)
#define DSIHOST_TCCR5_LSWR_TOCNT9          ((uint32_t)0x00000200)
#define DSIHOST_TCCR5_LSWR_TOCNT10         ((uint32_t)0x00000400)
#define DSIHOST_TCCR5_LSWR_TOCNT11         ((uint32_t)0x00000800)
#define DSIHOST_TCCR5_LSWR_TOCNT12         ((uint32_t)0x00001000)
#define DSIHOST_TCCR5_LSWR_TOCNT13         ((uint32_t)0x00002000)
#define DSIHOST_TCCR5_LSWR_TOCNT14         ((uint32_t)0x00004000)
#define DSIHOST_TCCR5_LSWR_TOCNT15         ((uint32_t)0x00008000)

/*******************  Bit definition for DSIHOST_TCCR6 register  **************/
#define DSIHOST_TCCR6_BTA_TOCNT            ((uint32_t)0x0000FFFF)               /*!< Bus-Turn-Around Timeout Counter */
#define DSIHOST_TCCR6_BTA_TOCNT0           ((uint32_t)0x00000001)
#define DSIHOST_TCCR6_BTA_TOCNT1           ((uint32_t)0x00000002)
#define DSIHOST_TCCR6_BTA_TOCNT2           ((uint32_t)0x00000004)
#define DSIHOST_TCCR6_BTA_TOCNT3           ((uint32_t)0x00000008)
#define DSIHOST_TCCR6_BTA_TOCNT4           ((uint32_t)0x00000010)
#define DSIHOST_TCCR6_BTA_TOCNT5           ((uint32_t)0x00000020)
#define DSIHOST_TCCR6_BTA_TOCNT6           ((uint32_t)0x00000040)
#define DSIHOST_TCCR6_BTA_TOCNT7           ((uint32_t)0x00000080)
#define DSIHOST_TCCR6_BTA_TOCNT8           ((uint32_t)0x00000100)
#define DSIHOST_TCCR6_BTA_TOCNT9           ((uint32_t)0x00000200)
#define DSIHOST_TCCR6_BTA_TOCNT10          ((uint32_t)0x00000400)
#define DSIHOST_TCCR6_BTA_TOCNT11          ((uint32_t)0x00000800)
#define DSIHOST_TCCR6_BTA_TOCNT12          ((uint32_t)0x00001000)
#define DSIHOST_TCCR6_BTA_TOCNT13          ((uint32_t)0x00002000)
#define DSIHOST_TCCR6_BTA_TOCNT14          ((uint32_t)0x00004000)
#define DSIHOST_TCCR6_BTA_TOCNT15          ((uint32_t)0x00008000)

/*******************  Bit definition for DSIHOST_TDCR register  ***************/
#define DSIHOST_TDCR_3DM                   ((uint32_t)0x00000003)               /*!< 3D Mode */
#define DSIHOST_TDCR_3DM0                  ((uint32_t)0x00000001)
#define DSIHOST_TDCR_3DM1                  ((uint32_t)0x00000002)

#define DSIHOST_TDCR_3DF                   ((uint32_t)0x0000000C)               /*!< 3D Format */
#define DSIHOST_TDCR_3DF0                  ((uint32_t)0x00000004)
#define DSIHOST_TDCR_3DF1                  ((uint32_t)0x00000008)

#define DSIHOST_TDCR_SVS                   ((uint32_t)0x00000010)               /*!< Second VSYNC */
#define DSIHOST_TDCR_RF                    ((uint32_t)0x00000020)               /*!< Right First */
#define DSIHOST_TDCR_S3DC                  ((uint32_t)0x00010000)               /*!< Send 3D Control */

