cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
#define DSIHOST_LPMCCR_LPSIZE              ((uint32_t)0x00FF0000)               /*!< Largest Packet Size */
#define DSIHOST_LPMCCR_LPSIZE0             ((uint32_t)0x00010000)
#define DSIHOST_LPMCCR_LPSIZE1             ((uint32_t)0x00020000)
#define DSIHOST_LPMCCR_LPSIZE2             ((uint32_t)0x00040000)
#define DSIHOST_LPMCCR_LPSIZE3             ((uint32_t)0x00080000)
#define DSIHOST_LPMCCR_LPSIZE4             ((uint32_t)0x00100000)
#define DSIHOST_LPMCCR_LPSIZE5             ((uint32_t)0x00200000)
#define DSIHOST_LPMCCR_LPSIZE6             ((uint32_t)0x00400000)
#define DSIHOST_LPMCCR_LPSIZE7             ((uint32_t)0x00800000)

/*******************  Bit definition for DSIHOST_VMCCR register  **************/
#define DSIHOST_VMCCR_VMT                  ((uint32_t)0x00000003)               /*!< Video Mode Type */
#define DSIHOST_VMCCR_VMT0                 ((uint32_t)0x00000001)
#define DSIHOST_VMCCR_VMT1                 ((uint32_t)0x00000002)

#define DSIHOST_VMCCR_LPVSAE               ((uint32_t)0x00000100)               /*!< Low-power Vertical Sync time Enable */
#define DSIHOST_VMCCR_LPVBPE               ((uint32_t)0x00000200)               /*!< Low-power Vertical Back-porch Enable */
#define DSIHOST_VMCCR_LPVFPE               ((uint32_t)0x00000400)               /*!< Low-power Vertical Front-porch Enable */
#define DSIHOST_VMCCR_LPVAE                ((uint32_t)0x00000800)               /*!< Low-power Vertical Active Enable */
#define DSIHOST_VMCCR_LPHBPE               ((uint32_t)0x00001000)               /*!< Low-power Horizontal Back-porch Enable */
#define DSIHOST_VMCCR_LPHFE                ((uint32_t)0x00002000)               /*!< Low-power Horizontal Front-porch Enable */
#define DSIHOST_VMCCR_FBTAAE               ((uint32_t)0x00004000)               /*!< Frame BTA Acknowledge Enable */
#define DSIHOST_VMCCR_LPCE                 ((uint32_t)0x00008000)               /*!< Low-power Command Enable */

/*******************  Bit definition for DSIHOST_VPCCR register  **************/
#define DSIHOST_VPCCR_VPSIZE               ((uint32_t)0x00003FFF)               /*!< Video Packet Size */
#define DSIHOST_VPCCR_VPSIZE0              ((uint32_t)0x00000001)
#define DSIHOST_VPCCR_VPSIZE1              ((uint32_t)0x00000002)
#define DSIHOST_VPCCR_VPSIZE2              ((uint32_t)0x00000004)
#define DSIHOST_VPCCR_VPSIZE3              ((uint32_t)0x00000008)
#define DSIHOST_VPCCR_VPSIZE4              ((uint32_t)0x00000010)
#define DSIHOST_VPCCR_VPSIZE5              ((uint32_t)0x00000020)
#define DSIHOST_VPCCR_VPSIZE6              ((uint32_t)0x00000040)
#define DSIHOST_VPCCR_VPSIZE7              ((uint32_t)0x00000080)
#define DSIHOST_VPCCR_VPSIZE8              ((uint32_t)0x00000100)
#define DSIHOST_VPCCR_VPSIZE9              ((uint32_t)0x00000200)
#define DSIHOST_VPCCR_VPSIZE10             ((uint32_t)0x00000400)
#define DSIHOST_VPCCR_VPSIZE11             ((uint32_t)0x00000800)
#define DSIHOST_VPCCR_VPSIZE12             ((uint32_t)0x00001000)
#define DSIHOST_VPCCR_VPSIZE13             ((uint32_t)0x00002000)

/*******************  Bit definition for DSIHOST_VCCCR register  **************/
#define DSIHOST_VCCCR_NUMC                 ((uint32_t)0x00001FFF)               /*!< Number of Chunks */
#define DSIHOST_VCCCR_NUMC0                ((uint32_t)0x00000001)
#define DSIHOST_VCCCR_NUMC1                ((uint32_t)0x00000002)
#define DSIHOST_VCCCR_NUMC2                ((uint32_t)0x00000004)
#define DSIHOST_VCCCR_NUMC3                ((uint32_t)0x00000008)
#define DSIHOST_VCCCR_NUMC4                ((uint32_t)0x00000010)
#define DSIHOST_VCCCR_NUMC5                ((uint32_t)0x00000020)
#define DSIHOST_VCCCR_NUMC6                ((uint32_t)0x00000040)
#define DSIHOST_VCCCR_NUMC7                ((uint32_t)0x00000080)
#define DSIHOST_VCCCR_NUMC8                ((uint32_t)0x00000100)
#define DSIHOST_VCCCR_NUMC9                ((uint32_t)0x00000200)
#define DSIHOST_VCCCR_NUMC10               ((uint32_t)0x00000400)
#define DSIHOST_VCCCR_NUMC11               ((uint32_t)0x00000800)
#define DSIHOST_VCCCR_NUMC12               ((uint32_t)0x00001000)

/*******************  Bit definition for DSIHOST_VNPCCR register  *************/
#define DSIHOST_VNPCCR_NPSIZE              ((uint32_t)0x00001FFF)               /*!< Number of Chunks */
#define DSIHOST_VNPCCR_NPSIZE0             ((uint32_t)0x00000001)
#define DSIHOST_VNPCCR_NPSIZE1             ((uint32_t)0x00000002)
#define DSIHOST_VNPCCR_NPSIZE2             ((uint32_t)0x00000004)
#define DSIHOST_VNPCCR_NPSIZE3             ((uint32_t)0x00000008)
#define DSIHOST_VNPCCR_NPSIZE4             ((uint32_t)0x00000010)
#define DSIHOST_VNPCCR_NPSIZE5             ((uint32_t)0x00000020)
#define DSIHOST_VNPCCR_NPSIZE6             ((uint32_t)0x00000040)
#define DSIHOST_VNPCCR_NPSIZE7             ((uint32_t)0x00000080)
#define DSIHOST_VNPCCR_NPSIZE8             ((uint32_t)0x00000100)
#define DSIHOST_VNPCCR_NPSIZE9             ((uint32_t)0x00000200)
#define DSIHOST_VNPCCR_NPSIZE10            ((uint32_t)0x00000400)
#define DSIHOST_VNPCCR_NPSIZE11            ((uint32_t)0x00000800)
#define DSIHOST_VNPCCR_NPSIZE12            ((uint32_t)0x00001000)

/*******************  Bit definition for DSIHOST_VHSACCR register  ************/
#define DSIHOST_VHSACCR_HSA                ((uint32_t)0x00000FFF)               /*!< Horizontal Synchronism Active duration */
#define DSIHOST_VHSACCR_HSA0               ((uint32_t)0x00000001)
#define DSIHOST_VHSACCR_HSA1               ((uint32_t)0x00000002)
#define DSIHOST_VHSACCR_HSA2               ((uint32_t)0x00000004)
#define DSIHOST_VHSACCR_HSA3               ((uint32_t)0x00000008)
#define DSIHOST_VHSACCR_HSA4               ((uint32_t)0x00000010)
#define DSIHOST_VHSACCR_HSA5               ((uint32_t)0x00000020)
#define DSIHOST_VHSACCR_HSA6               ((uint32_t)0x00000040)
#define DSIHOST_VHSACCR_HSA7               ((uint32_t)0x00000080)
#define DSIHOST_VHSACCR_HSA8               ((uint32_t)0x00000100)
#define DSIHOST_VHSACCR_HSA9               ((uint32_t)0x00000200)
#define DSIHOST_VHSACCR_HSA10              ((uint32_t)0x00000400)
#define DSIHOST_VHSACCR_HSA11              ((uint32_t)0x00000800)

/*******************  Bit definition for DSIHOST_VHBPCCR register  ************/
#define DSIHOST_VHBPCCR_HBP                ((uint32_t)0x00000FFF)               /*!< Horizontal Back-Porch duration */
#define DSIHOST_VHBPCCR_HBP0               ((uint32_t)0x00000001)
#define DSIHOST_VHBPCCR_HBP1               ((uint32_t)0x00000002)
#define DSIHOST_VHBPCCR_HBP2               ((uint32_t)0x00000004)
#define DSIHOST_VHBPCCR_HBP3               ((uint32_t)0x00000008)
#define DSIHOST_VHBPCCR_HBP4               ((uint32_t)0x00000010)
#define DSIHOST_VHBPCCR_HBP5               ((uint32_t)0x00000020)
#define DSIHOST_VHBPCCR_HBP6               ((uint32_t)0x00000040)
#define DSIHOST_VHBPCCR_HBP7               ((uint32_t)0x00000080)
#define DSIHOST_VHBPCCR_HBP8               ((uint32_t)0x00000100)
#define DSIHOST_VHBPCCR_HBP9               ((uint32_t)0x00000200)
#define DSIHOST_VHBPCCR_HBP10              ((uint32_t)0x00000400)
#define DSIHOST_VHBPCCR_HBP11              ((uint32_t)0x00000800)

/*******************  Bit definition for DSIHOST_VLCCR register  **************/
#define DSIHOST_VLCCR_HLINE                ((uint32_t)0x00007FFF)               /*!< Horizontal Line duration */
#define DSIHOST_VLCCR_HLINE0               ((uint32_t)0x00000001)
#define DSIHOST_VLCCR_HLINE1               ((uint32_t)0x00000002)
#define DSIHOST_VLCCR_HLINE2               ((uint32_t)0x00000004)
#define DSIHOST_VLCCR_HLINE3               ((uint32_t)0x00000008)
#define DSIHOST_VLCCR_HLINE4               ((uint32_t)0x00000010)
#define DSIHOST_VLCCR_HLINE5               ((uint32_t)0x00000020)
#define DSIHOST_VLCCR_HLINE6               ((uint32_t)0x00000040)
#define DSIHOST_VLCCR_HLINE7               ((uint32_t)0x00000080)
#define DSIHOST_VLCCR_HLINE8               ((uint32_t)0x00000100)
#define DSIHOST_VLCCR_HLINE9               ((uint32_t)0x00000200)
#define DSIHOST_VLCCR_HLINE10              ((uint32_t)0x00000400)
#define DSIHOST_VLCCR_HLINE11              ((uint32_t)0x00000800)
#define DSIHOST_VLCCR_HLINE12              ((uint32_t)0x00001000)
#define DSIHOST_VLCCR_HLINE13              ((uint32_t)0x00002000)
#define DSIHOST_VLCCR_HLINE14              ((uint32_t)0x00004000)

/*******************  Bit definition for DSIHOST_VVSACCR register  ***************/
#define DSIHOST_VVSACCR_VSA                   ((uint32_t)0x000003FF)               /*!< Vertical Synchronism Active duration */
#define DSIHOST_VVSACCR_VSA0                  ((uint32_t)0x00000001)
#define DSIHOST_VVSACCR_VSA1                  ((uint32_t)0x00000002)
#define DSIHOST_VVSACCR_VSA2                  ((uint32_t)0x00000004)
#define DSIHOST_VVSACCR_VSA3                  ((uint32_t)0x00000008)
#define DSIHOST_VVSACCR_VSA4                  ((uint32_t)0x00000010)
#define DSIHOST_VVSACCR_VSA5                  ((uint32_t)0x00000020)
#define DSIHOST_VVSACCR_VSA6                  ((uint32_t)0x00000040)
#define DSIHOST_VVSACCR_VSA7                  ((uint32_t)0x00000080)
#define DSIHOST_VVSACCR_VSA8                  ((uint32_t)0x00000100)
#define DSIHOST_VVSACCR_VSA9                  ((uint32_t)0x00000200)

