cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/*******************  Bit definition for DSIHOST_VVBPCCR register  ************/
#define DSIHOST_VVBPCCR_VBP                ((uint32_t)0x000003FF)               /*!< Vertical Back-Porch duration */
#define DSIHOST_VVBPCCR_VBP0               ((uint32_t)0x00000001)
#define DSIHOST_VVBPCCR_VBP1               ((uint32_t)0x00000002)
#define DSIHOST_VVBPCCR_VBP2               ((uint32_t)0x00000004)
#define DSIHOST_VVBPCCR_VBP3               ((uint32_t)0x00000008)
#define DSIHOST_VVBPCCR_VBP4               ((uint32_t)0x00000010)
#define DSIHOST_VVBPCCR_VBP5               ((uint32_t)0x00000020)
#define DSIHOST_VVBPCCR_VBP6               ((uint32_t)0x00000040)
#define DSIHOST_VVBPCCR_VBP7               ((uint32_t)0x00000080)
#define DSIHOST_VVBPCCR_VBP8               ((uint32_t)0x00000100)
#define DSIHOST_VVBPCCR_VBP9               ((uint32_t)0x00000200)

/*******************  Bit definition for DSIHOST_VVFPCCR register  ************/
#define DSIHOST_VVFPCCR_VFP                ((uint32_t)0x000003FF)               /*!< Vertical Front-Porch duration */
#define DSIHOST_VVFPCCR_VFP0               ((uint32_t)0x00000001)
#define DSIHOST_VVFPCCR_VFP1               ((uint32_t)0x00000002)
#define DSIHOST_VVFPCCR_VFP2               ((uint32_t)0x00000004)
#define DSIHOST_VVFPCCR_VFP3               ((uint32_t)0x00000008)
#define DSIHOST_VVFPCCR_VFP4               ((uint32_t)0x00000010)
#define DSIHOST_VVFPCCR_VFP5               ((uint32_t)0x00000020)
#define DSIHOST_VVFPCCR_VFP6               ((uint32_t)0x00000040)
#define DSIHOST_VVFPCCR_VFP7               ((uint32_t)0x00000080)
#define DSIHOST_VVFPCCR_VFP8               ((uint32_t)0x00000100)
#define DSIHOST_VVFPCCR_VFP9               ((uint32_t)0x00000200)

/*******************  Bit definition for DSIHOST_VVACCR register  *************/
#define DSIHOST_VVACCR_VA                  ((uint32_t)0x00003FFF)               /*!< Vertical Active duration */
#define DSIHOST_VVACCR_VA0                 ((uint32_t)0x00000001)
#define DSIHOST_VVACCR_VA1                 ((uint32_t)0x00000002)
#define DSIHOST_VVACCR_VA2                 ((uint32_t)0x00000004)
#define DSIHOST_VVACCR_VA3                 ((uint32_t)0x00000008)
#define DSIHOST_VVACCR_VA4                 ((uint32_t)0x00000010)
#define DSIHOST_VVACCR_VA5                 ((uint32_t)0x00000020)
#define DSIHOST_VVACCR_VA6                 ((uint32_t)0x00000040)
#define DSIHOST_VVACCR_VA7                 ((uint32_t)0x00000080)
#define DSIHOST_VVACCR_VA8                 ((uint32_t)0x00000100)
#define DSIHOST_VVACCR_VA9                 ((uint32_t)0x00000200)
#define DSIHOST_VVACCR_VA10                ((uint32_t)0x00000400)
#define DSIHOST_VVACCR_VA11                ((uint32_t)0x00000800)
#define DSIHOST_VVACCR_VA12                ((uint32_t)0x00001000)
#define DSIHOST_VVACCR_VA13                ((uint32_t)0x00002000)

/*******************  Bit definition for DSIHOST_TDCCR register  **************/
#define DSIHOST_TDCCR_3DM                  ((uint32_t)0x00000003)               /*!< 3D Mode */
#define DSIHOST_TDCCR_3DM0                 ((uint32_t)0x00000001)
#define DSIHOST_TDCCR_3DM1                 ((uint32_t)0x00000002)

#define DSIHOST_TDCCR_3DF                  ((uint32_t)0x0000000C)               /*!< 3D Format */
#define DSIHOST_TDCCR_3DF0                 ((uint32_t)0x00000004)
#define DSIHOST_TDCCR_3DF1                 ((uint32_t)0x00000008)

#define DSIHOST_TDCCR_SVS                  ((uint32_t)0x00000010)               /*!< Second VSYNC */
#define DSIHOST_TDCCR_RF                   ((uint32_t)0x00000020)               /*!< Right First */
#define DSIHOST_TDCCR_S3DC                 ((uint32_t)0x00010000)               /*!< Send 3D Control */

//MGh
/******************************************************************************/
/*                                                                            */
/*                                  DSI Wrapper                               */
/*                                                                            */
/******************************************************************************/ 
/*******************  Bit definition for DSIWRAP_CFGR register  ***************/
#define DSIWRAP_CFGR_DSIM                   ((uint32_t)0x00000001)              /*!< DSI Mode */
#define DSIWRAP_CFGR_COLMUX                 ((uint32_t)0x0000000E)              /*!< Color Multiplexing */
#define DSIWRAP_CFGR_COLMUX0                ((uint32_t)0x00000002)
#define DSIWRAP_CFGR_COLMUX1                ((uint32_t)0x00000004)
#define DSIWRAP_CFGR_COLMUX2                ((uint32_t)0x00000008)
 
#define DSIWRAP_CFGR_TESRC                  ((uint32_t)0x00000010)              /*!< Tearing Effect Source */
#define DSIWRAP_CFGR_TEPOL                  ((uint32_t)0x00000020)              /*!< Tearing Effect Polarity */
#define DSIWRAP_CFGR_AR                     ((uint32_t)0x00000040)              /*!< Automatic Refresh */
#define DSIWRAP_CFGR_VSPOL                  ((uint32_t)0x00000080)              /*!< VSync Polarity */

/*******************  Bit definition for DSIWRAP_CR register  *****************/
#define DSIWRAP_CR_COLM                     ((uint32_t)0x00000001)              /*!< Color Mode */
#define DSIWRAP_CR_SHTDN                    ((uint32_t)0x00000002)              /*!< Shutdown */
#define DSIWRAP_CR_LTDCEN                   ((uint32_t)0x00000004)              /*!< LTDC Enable */
#define DSIWRAP_CR_DSIEN                    ((uint32_t)0x00000008)              /*!< DSI Enable */

/*******************  Bit definition for DSIWRAP_IER register  ****************/
#define DSIWRAP_IER_TEIE                    ((uint32_t)0x00000001)              /*!< Tearing Effect Interrupt Enable */
#define DSIWRAP_IER_ERIE                    ((uint32_t)0x00000002)              /*!< End of Refresh Interrupt Enable */
#define DSIWRAP_IER_PLLLIE                  ((uint32_t)0x00000200)              /*!< PLL Lock Interrupt Enable */
#define DSIWRAP_IER_PLLUIE                  ((uint32_t)0x00000400)              /*!< PLL Unlock Interrupt Enable */
#define DSIWRAP_IER_RRIE                    ((uint32_t)0x00002000)              /*!< Regulator Ready Interrupt Enable */

