cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/*******************  Bit definition for DSIWRAP_ISR register  ****************/
#define DSIWRAP_ISR_TEIF                    ((uint32_t)0x00000001)              /*!< Tearing Effect Interrupt Flag */
#define DSIWRAP_ISR_ERIF                    ((uint32_t)0x00000002)              /*!< End of Refresh Interrupt Flag */
#define DSIWRAP_ISR_BUSY                    ((uint32_t)0x00000004)              /*!< Busy Flag */
#define DSIWRAP_ISR_PLLLS                   ((uint32_t)0x00000100)              /*!< PLL Lock Status */
#define DSIWRAP_ISR_PLLLIF                  ((uint32_t)0x00000200)              /*!< PLL Lock Interrupt Flag */
#define DSIWRAP_ISR_PLLUIF                  ((uint32_t)0x00000400)              /*!< PLL Unlock Interrupt Flag */
#define DSIWRAP_ISR_RRS                     ((uint32_t)0x00001000)              /*!< Regulator Ready Flag */
#define DSIWRAP_ISR_RRIF                    ((uint32_t)0x00002000)              /*!< Regulator Ready Interrupt Flag */

/*******************  Bit definition for DSIWRAP_IFCR register  ***************/
#define DSIWRAP_IFCR_CTEIF                  ((uint32_t)0x00000001)              /*!< Clear Tearing Effect Interrupt Flag */
#define DSIWRAP_IFCR_CERIF                  ((uint32_t)0x00000002)              /*!< Clear End of Refresh Interrupt Flag */
#define DSIWRAP_IFCR_CPLLLIF                ((uint32_t)0x00000200)              /*!< Clear PLL Lock Interrupt Flag */
#define DSIWRAP_IFCR_CPLLUIF                ((uint32_t)0x00000400)              /*!< Clear PLL Unlock Interrupt Flag */
#define DSIWRAP_IFCR_CRRIF                  ((uint32_t)0x00002000)              /*!< Clear Regulator Ready Interrupt Flag */

/*******************  Bit definition for DSIWRAP_PCR1 register  ***************/
#define DSIWRAP_PCR1_UIX4                   ((uint32_t)0x0000003F)              /*!< Unit Interval multiplied by 4 */
#define DSIWRAP_PCR1_UIX4_0                 ((uint32_t)0x00000001)
#define DSIWRAP_PCR1_UIX4_1                 ((uint32_t)0x00000002)
#define DSIWRAP_PCR1_UIX4_2                 ((uint32_t)0x00000004)
#define DSIWRAP_PCR1_UIX4_3                 ((uint32_t)0x00000008)
#define DSIWRAP_PCR1_UIX4_4                 ((uint32_t)0x00000010)
#define DSIWRAP_PCR1_UIX4_5                 ((uint32_t)0x00000020)

#define DSIWRAP_PCR1_SWCL                   ((uint32_t)0x00000040)              /*!< Swap pins on clock lane */
#define DSIWRAP_PCR1_SWDL0                  ((uint32_t)0x00000080)              /*!< Swap pins on data lane 1 */
#define DSIWRAP_PCR1_SWDL1                  ((uint32_t)0x00000100)              /*!< Swap pins on data lane 2 */
#define DSIWRAP_PCR1_HSICL                  ((uint32_t)0x00000200)              /*!< Invert the high-speed data signal on clock lane */
#define DSIWRAP_PCR1_HSIDL0                 ((uint32_t)0x00000400)              /*!< Invert the high-speed data signal on lane 1 */
#define DSIWRAP_PCR1_HSIDL1                 ((uint32_t)0x00000800)              /*!< Invert the high-speed data signal on lane 2 */
#define DSIWRAP_PCR1_FTXSMCL                ((uint32_t)0x00001000)              /*!< Force clock lane in TX stop mode */
#define DSIWRAP_PCR1_FTXSMDL                ((uint32_t)0x00002000)              /*!< Force data lanes in TX stop mode */
#define DSIWRAP_PCR1_CDOFFDL                ((uint32_t)0x00004000)              /*!< Contention detection OFF */
#define DSIWRAP_PCR1_TDDL                   ((uint32_t)0x00010000)              /*!< Turn Disable Data Lanes */
#define DSIWRAP_PCR1_PDEN                   ((uint32_t)0x00040000)              /*!< Pull-Down Enable */
#define DSIWRAP_PCR1_TCLKPREPEN             ((uint32_t)0x00080000)              /*!< Timer for t-CLKPREP Enable */
#define DSIWRAP_PCR1_TCLKZEROEN             ((uint32_t)0x00100000)              /*!< Timer for t-CLKZERO Enable */
#define DSIWRAP_PCR1_THSPREPEN              ((uint32_t)0x00200000)              /*!< Timer for t-HSPREP Enable */
#define DSIWRAP_PCR1_THSTRAILEN             ((uint32_t)0x00400000)              /*!< Timer for t-HSTRAIL Enable */
#define DSIWRAP_PCR1_THSZEROEN              ((uint32_t)0x00800000)              /*!< Timer for t-HSZERO Enable */
#define DSIWRAP_PCR1_TLPXDEN                ((uint32_t)0x01000000)              /*!< Timer for t-LPXD Enable */
#define DSIWRAP_PCR1_THSEXITEN              ((uint32_t)0x02000000)              /*!< Timer for t-HSEXIT Enable */
#define DSIWRAP_PCR1_TLPXCEN                ((uint32_t)0x04000000)              /*!< Timer for t-LPXC Enable */
#define DSIWRAP_PCR1_TCLKPOSTEN             ((uint32_t)0x08000000)              /*!< Timer for t-CLKPOST Enable */

/*******************  Bit definition for DSIWRAP_PCR2 register  ***************/
#define DSIWRAP_PCR2_HSTXDCL                ((uint32_t)0x00000003)              /*!< High-Speed Transmission Delay on Clock Lane */
#define DSIWRAP_PCR2_HSTXDCL0               ((uint32_t)0x00000001)
#define DSIWRAP_PCR2_HSTXDCL1               ((uint32_t)0x00000002)

#define DSIWRAP_PCR2_HSTXDDL                ((uint32_t)0x0000000C)              /*!< High-Speed Transmission Delay on Data Lane */
#define DSIWRAP_PCR2_HSTXDDL0               ((uint32_t)0x00000004)
#define DSIWRAP_PCR2_HSTXDDL1               ((uint32_t)0x00000008)

#define DSIWRAP_PCR2_LPSRCCL                ((uint32_t)0x000000C0)              /*!< Low-Power transmission Slew Rate Compensation on Clock Lane */
#define DSIWRAP_PCR2_LPSRCCL0               ((uint32_t)0x00000040)
#define DSIWRAP_PCR2_LPSRCCL1               ((uint32_t)0x00000080)

#define DSIWRAP_PCR2_LPSRCDL                ((uint32_t)0x00000300)              /*!< Low-Power transmission Slew Rate Compensation on Data Lane */
#define DSIWRAP_PCR2_LPSRCDL0               ((uint32_t)0x00000100)
#define DSIWRAP_PCR2_LPSRCDL1               ((uint32_t)0x00000200)

#define DSIWRAP_PCR2_SDDC                   ((uint32_t)0x00001000)              /*!< SDD Control */

#define DSIWRAP_PCR2_LPRXVCDL               ((uint32_t)0x0000C000)              /*!< Low-Power Reception V-IL Compensation on Data Lanes */
#define DSIWRAP_PCR2_LPRXVCDL0              ((uint32_t)0x00004000)
#define DSIWRAP_PCR2_LPRXVCDL1              ((uint32_t)0x00008000)

