cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for FLASH_FACR register  *****************/
#define FLASH_FACR_LATENCY             ((uint32_t)0x0000000F)
#define FLASH_LATENCY_0WS              ((uint32_t)0x00000000)
#define FLASH_LATENCY_1WS              ((uint32_t)0x00000001)
#define FLASH_LATENCY_2WS              ((uint32_t)0x00000002)
#define FLASH_LATENCY_3WS              ((uint32_t)0x00000003)
#define FLASH_LATENCY_4WS              ((uint32_t)0x00000004)
#define FLASH_LATENCY_5WS              ((uint32_t)0x00000005)
#define FLASH_LATENCY_6WS              ((uint32_t)0x00000006)
#define FLASH_LATENCY_7WS              ((uint32_t)0x00000007)
#define FLASH_LATENCY_8WS              ((uint32_t)0x00000008)
#define FLASH_LATENCY_9WS              ((uint32_t)0x00000009)
#define FLASH_LATENCY_10WS             ((uint32_t)0x0000000A)
#define FLASH_LATENCY_11WS             ((uint32_t)0x0000000B)
#define FLASH_LATENCY_12WS             ((uint32_t)0x0000000C)
#define FLASH_LATENCY_13WS             ((uint32_t)0x0000000D)
#define FLASH_LATENCY_14WS             ((uint32_t)0x0000000E)
#define FLASH_LATENCY_15WS             ((uint32_t)0x0000000F)

/*******************  Bits definition for FLASH_FKEYR_A register  *****************/
#define FLASH_FKEYR_A_KEYR_A           ((uint32_t)0xFFFFFFFF)

/*******************  Bits definition for FLASH_FOPTKEYR register  *****************/
#define FLASH_OPTKEYR                  ((uint32_t)0xFFFFFFFF)

/*******************  Bits definition for FLASH_FSR_A register  *****************/
#define FLASH_FSR_A_BSY_A                    ((uint32_t)0x00000001)
#define FLASH_FSR_A_WDW_A                    ((uint32_t)0x00000002)
#define FLASH_FSR_A_QW_A                     ((uint32_t)0x00000004)
#define FLASH_FSR_A_FAIL_FLASH_A             ((uint32_t)0x00000008)
#define FLASH_FSR_A_EOP_A                    ((uint32_t)0x00010000)
#define FLASH_FSR_A_WRPERR_A                 ((uint32_t)0x00020000)
#define FLASH_FSR_A_PGSERR_A                 ((uint32_t)0x00040000)
#define FLASH_FSR_A_PGAERR_A                 ((uint32_t)0x00080000)
#define FLASH_FSR_A_NDELERR_A                ((uint32_t)0x00100000)
#define FLASH_FSR_A_INCERR_A                 ((uint32_t)0x00200000)
#define FLASH_FSR_A_OPERR_A                  ((uint32_t)0x00400000)
#define FLASH_FSR_A_RDPERR_A                 ((uint32_t)0x00800000)
#define FLASH_FSR_A_RDSERR_A                 ((uint32_t)0x01000000)
#define FLASH_FSR_A_SNECCERR_A               ((uint32_t)0x02000000)
#define FLASH_FSR_A_DBECCERR_A               ((uint32_t)0x04000000)

/*******************  Bits definition for FLASH_FCR_A register  *****************/
#define FLASH_FCR_A_LOCK_A                   ((uint32_t)0x00000001)
#define FLASH_FCR_A_PG_A                     ((uint32_t)0x00000002)
#define FLASH_FCR_A_SER_A                    ((uint32_t)0x00000004)
#define FLASH_FCR_A_BER_A                    ((uint32_t)0x00000008)
#define FLASH_FCR_A_SSN_A                    ((uint32_t)0x00000700)
#define FLASH_FCR_A_SSN_A_0                  ((uint32_t)0x00000010)
#define FLASH_FCR_A_SSN_A_1                  ((uint32_t)0x00000020)
#define FLASH_FCR_A_SSN_A_2                  ((uint32_t)0x00000040)
#define FLASH_FCR_A_PSIZE_A                  ((uint32_t)0x00000030)
#define FLASH_FCR_A_PSIZE_A_0                ((uint32_t)0x00000100)
#define FLASH_FCR_A_PSIZE_A_1                ((uint32_t)0x00000200)
#define FLASH_FCR_A_FW_A                     ((uint32_t)0x00000040)
#define FLASH_FCR_A_STRT_A                   ((uint32_t)0x00000080)
#define FLASH_FCR_A_EOPIE_A                  ((uint32_t)0x00010000)
#define FLASH_FCR_A_WRPERRIE_A               ((uint32_t)0x00020000)
#define FLASH_FCR_A_PGSERRIE_A               ((uint32_t)0x00040000)
#define FLASH_FCR_A_PGAERRIE_A               ((uint32_t)0x00080000)
#define FLASH_FCR_A_NDELERRIE_A              ((uint32_t)0x00100000)
#define FLASH_FCR_A_INCERRIE_A               ((uint32_t)0x00200000)
#define FLASH_FCR_A_OPERRIE_A                ((uint32_t)0x00400000)
#define FLASH_FCR_A_RDPERRIE_A               ((uint32_t)0x00800000)
#define FLASH_FCR_A_RDSERRIE_A               ((uint32_t)0x01000000)
#define FLASH_FCR_A_SNECCERRIE_A             ((uint32_t)0x02000000)
#define FLASH_FCR_A_DBECCERRIE_A             ((uint32_t)0x04000000)

/*******************  Bits definition for FLASH_FOPTCR register  *****************/
#define FLASH_FOPTCR_OPTLOCK                 ((uint32_t)0x00000001)
#define FLASH_FOPTCR_OPTSTRT                 ((uint32_t)0x00000002)
#define FLASH_FOPTCR_OBL_LAUNCH              ((uint32_t)0x00000004)
#define FLASH_FOPTCR_OPTVERRIE               ((uint32_t)0x00010000)
#define FLASH_FOPTCR_SWAP_BANK               ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FOPTSR_CUR register  *****************/
#define FLASH_FOPTSR_CUR_BOR_LEV             ((uint32_t)0x0000000C)
#define FLASH_FOPTSR_CUR_BOR_LEV_0           ((uint32_t)0x00000004)
#define FLASH_FOPTSR_CUR_BOR_LEV_1           ((uint32_t)0x00000008)
#define FLASH_FOPTSR_CUR_IWDG_SW             ((uint32_t)0x00000010)
#define FLASH_FOPTSR_CUR_WWDG_SW             ((uint32_t)0x00000020)
#define FLASH_FOPTSR_CUR_NRST_STOP           ((uint32_t)0x00000040)
#define FLASH_FOPTSR_CUR_NRST_STDY           ((uint32_t)0x00000080)
#define FLASH_FOPTSR_CUR_RDP                 ((uint32_t)0x0000FF00)
#define FLASH_FOPTSR_CUR_OPTVERR             ((uint32_t)0x00010000)
#define FLASH_FOPTSR_CUR_FZ_IWDG_STOP        ((uint32_t)0x00020000)
#define FLASH_FOPTSR_CUR_FZ_IWDG_SDBY        ((uint32_t)0x00040000)
#define FLASH_FOPTSR_CUR_ST_RAM_SIZE         ((uint32_t)0x00180000)
#define FLASH_FOPTSR_CUR_ST_RAM_SIZE_0       ((uint32_t)0x00080000)
#define FLASH_FOPTSR_CUR_ST_RAM_SIZE_1       ((uint32_t)0x00100000)
#define FLASH_FOPTSR_CUR_EPCROP_EN           ((uint32_t)0x00200000)
#define FLASH_FOPTSR_CUR_BCM4                ((uint32_t)0x20000000)
#define FLASH_FOPTSR_CUR_BCM7                ((uint32_t)0x40000000)
#define FLASH_FOPTSR_CUR_SWAP_BANK_OPT       ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FOPTSR_PRG register  *****************/
#define FLASH_FOPTSR_PRG_BOR_LEV                 ((uint32_t)0x0000000C)
#define FLASH_FOPTSR_PRG_BOR_LEV_0               ((uint32_t)0x00000004)
#define FLASH_FOPTSR_PRG_BOR_LEV_1               ((uint32_t)0x00000008)
#define FLASH_FOPTSR_PRG_IWDG_SW                 ((uint32_t)0x00000010)
#define FLASH_FOPTSR_PRG_WWDG_SW                 ((uint32_t)0x00000020)
#define FLASH_FOPTSR_PRG_NRST_STOP               ((uint32_t)0x00000040)
#define FLASH_FOPTSR_PRG_NRST_STDY               ((uint32_t)0x00000080)
#define FLASH_FOPTSR_PRG_RDP                     ((uint32_t)0x0000FF00)
#define FLASH_FOPTSR_PRG_OPTVERR                 ((uint32_t)0x00010000)
#define FLASH_FOPTSR_PRG_FZ_IWDG_STOP            ((uint32_t)0x00020000)
#define FLASH_FOPTSR_PRG_FZ_IWDG_SDBY            ((uint32_t)0x00040000)
#define FLASH_FOPTSR_PRG_ST_RAM_SIZE             ((uint32_t)0x00180000)
#define FLASH_FOPTSR_PRG_ST_RAM_SIZE_0           ((uint32_t)0x00080000)
#define FLASH_FOPTSR_PRG_ST_RAM_SIZE_1           ((uint32_t)0x00100000)
#define FLASH_FOPTSR_PRG_EPCROP_EN               ((uint32_t)0x00200000)
#define FLASH_FOPTSR_PRG_BCM4                    ((uint32_t)0x20000000)
#define FLASH_FOPTSR_PRG_BCM7                    ((uint32_t)0x40000000)
#define FLASH_FOPTSR_PRG_SWAP_BANK_OPT           ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FPRAR_CUR_A register  *****************/
#define FLASH_FPRAR_CUR_A_PROT_AREA_START_A      ((uint32_t)0x00000FFF)
#define FLASH_FPRAR_CUR_A_PROT_AREA_END_A        ((uint32_t)0x0FFF0000)
#define FLASH_FPRAR_CUR_A_DMEP_A                 ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FPRAR_PRG_A register  *****************/
#define FLASH_FPRAR_PRG_A_PROT_AREA_START_A      ((uint32_t)0x00000FFF)
#define FLASH_FPRAR_PRG_A_PROT_AREA_END_A        ((uint32_t)0x0FFF0000)
#define FLASH_FPRAR_PRG_A_DMEP_A                 ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FSCAR_CUR_A register  *****************/
#define FLASH_FSCAR_CUR_A_SEC_AREA_START_A       ((uint32_t)0x00000FFF)
#define FLASH_FSCAR_CUR_A_SEC_AREA_END_A         ((uint32_t)0x0FFF0000)
#define FLASH_FSCAR_CUR_A_DMES_A                 ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FSCAR_PRG_A register  *****************/
#define FLASH_FSCAR_PRG_A_SEC_AREA_START_A       ((uint32_t)0x00000FFF)
#define FLASH_FSCAR_PRG_A_SEC_AREA_END_A         ((uint32_t)0x0FFF0000)
#define FLASH_FSCAR_PRG_A_DMES_A                 ((uint32_t)0x80000000)

/*******************  Bits definition for FLASH_FWRPN_CUR_A register  *****************/
#define FLASH_FWRPN_CUR_A_WRPSN_A                ((uint32_t)0x000000FF)

/*******************  Bits definition for FLASH_FWRPN_PRG_A register  *****************/
#define FLASH_FWRPN_PRG_A_WRPSN_A                ((uint32_t)0x000000FF)

