cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
#define LTDC_CPSR_CYPOS                     ((uint32_t)0x0000FFFF)              /*!< Current Y Position */
#define LTDC_CPSR_CXPOS                     ((uint32_t)0xFFFF0000)              /*!< Current X Position */

/********************  Bit definition for LTDC_CDSR register  *****************/

#define LTDC_CDSR_VDES                      ((uint32_t)0x00000001)              /*!< Vertical Data Enable Status */
#define LTDC_CDSR_HDES                      ((uint32_t)0x00000002)              /*!< Horizontal Data Enable Status */
#define LTDC_CDSR_VSYNCS                    ((uint32_t)0x00000004)              /*!< Vertical Synchronization Status */
#define LTDC_CDSR_HSYNCS                    ((uint32_t)0x00000008)              /*!< Horizontal Synchronization Status */

/********************  Bit definition for LTDC_LxCR register  *****************/

#define LTDC_LxCR_LEN                       ((uint32_t)0x00000001)              /*!< Layer Enable */
#define LTDC_LxCR_COLKEN                    ((uint32_t)0x00000002)              /*!< Color Keying Enable */
#define LTDC_LxCR_CLUTEN                    ((uint32_t)0x00000010)              /*!< Color Lockup Table Enable */

/********************  Bit definition for LTDC_LxWHPCR register  **************/

#define LTDC_LxWHPCR_WHSTPOS                ((uint32_t)0x00000FFF)              /*!< Window Horizontal Start Position */
#define LTDC_LxWHPCR_WHSPPOS                ((uint32_t)0xFFFF0000)              /*!< Window Horizontal Stop Position */

/********************  Bit definition for LTDC_LxWVPCR register  **************/

#define LTDC_LxWVPCR_WVSTPOS                ((uint32_t)0x00000FFF)              /*!< Window Vertical Start Position */
#define LTDC_LxWVPCR_WVSPPOS                ((uint32_t)0xFFFF0000)              /*!< Window Vertical Stop Position */

/********************  Bit definition for LTDC_LxCKCR register  ***************/

#define LTDC_LxCKCR_CKBLUE                  ((uint32_t)0x000000FF)              /*!< Color Key Blue value */
#define LTDC_LxCKCR_CKGREEN                 ((uint32_t)0x0000FF00)              /*!< Color Key Green value */
#define LTDC_LxCKCR_CKRED                   ((uint32_t)0x00FF0000)              /*!< Color Key Red value */

/********************  Bit definition for LTDC_LxPFCR register  ***************/

#define LTDC_LxPFCR_PF                      ((uint32_t)0x00000007)              /*!< Pixel Format */

/********************  Bit definition for LTDC_LxCACR register  ***************/

#define LTDC_LxCACR_CONSTA                  ((uint32_t)0x000000FF)              /*!< Constant Alpha */

/********************  Bit definition for LTDC_LxDCCR register  ***************/

#define LTDC_LxDCCR_DCBLUE                  ((uint32_t)0x000000FF)              /*!< Default Color Blue */
#define LTDC_LxDCCR_DCGREEN                 ((uint32_t)0x0000FF00)              /*!< Default Color Green */
#define LTDC_LxDCCR_DCRED                   ((uint32_t)0x00FF0000)              /*!< Default Color Red */
#define LTDC_LxDCCR_DCALPHA                 ((uint32_t)0xFF000000)              /*!< Default Color Alpha */
                                
/********************  Bit definition for LTDC_LxBFCR register  ***************/

#define LTDC_LxBFCR_BF2                     ((uint32_t)0x00000007)              /*!< Blending Factor 2 */
#define LTDC_LxBFCR_BF1                     ((uint32_t)0x00000700)              /*!< Blending Factor 1 */

/********************  Bit definition for LTDC_LxCFBAR register  **************/

#define LTDC_LxCFBAR_CFBADD                 ((uint32_t)0xFFFFFFFF)              /*!< Color Frame Buffer Start Address */

/********************  Bit definition for LTDC_LxCFBLR register  **************/

#define LTDC_LxCFBLR_CFBLL                  ((uint32_t)0x00001FFF)              /*!< Color Frame Buffer Line Length */
#define LTDC_LxCFBLR_CFBP                   ((uint32_t)0x1FFF0000)              /*!< Color Frame Buffer Pitch in bytes */

/********************  Bit definition for LTDC_LxCFBLNR register  *************/

#define LTDC_LxCFBLNR_CFBLNBR               ((uint32_t)0x000007FF)              /*!< Frame Buffer Line Number */

/********************  Bit definition for LTDC_LxCLUTWR register  *************/

#define LTDC_LxCLUTWR_BLUE                  ((uint32_t)0x000000FF)              /*!< Blue value */
#define LTDC_LxCLUTWR_GREEN                 ((uint32_t)0x0000FF00)              /*!< Green value */
#define LTDC_LxCLUTWR_RED                   ((uint32_t)0x00FF0000)              /*!< Red value */
#define LTDC_LxCLUTWR_CLUTADD               ((uint32_t)0xFF000000)              /*!< CLUT address */

/******************************************************************************/
/*                                                                            */
/*                                     MDMA                                   */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for MDMA_GISR0 register  ****************/
#define MDMA_GISR0_GIF0                           ((uint32_t)0x00000001)              /*!< Channel 0 global interrupt flag */
#define MDMA_GISR0_GIF1                           ((uint32_t)0x00000002)              /*!< Channel 1 global interrupt flag */
#define MDMA_GISR0_GIF2                           ((uint32_t)0x00000004)              /*!< Channel 2 global interrupt flag */
#define MDMA_GISR0_GIF3                           ((uint32_t)0x00000008)              /*!< Channel 3 global interrupt flag */
#define MDMA_GISR0_GIF4                           ((uint32_t)0x00000010)              /*!< Channel 4 global interrupt flag */
#define MDMA_GISR0_GIF5                           ((uint32_t)0x00000020)              /*!< Channel 5 global interrupt flag */
#define MDMA_GISR0_GIF6                           ((uint32_t)0x00000040)              /*!< Channel 6 global interrupt flag */
#define MDMA_GISR0_GIF7                           ((uint32_t)0x00000080)              /*!< Channel 7 global interrupt flag */
#define MDMA_GISR0_GIF8                           ((uint32_t)0x00000100)              /*!< Channel 8 global interrupt flag */
#define MDMA_GISR0_GIF9                           ((uint32_t)0x00000200)              /*!< Channel 9 global interrupt flag */
#define MDMA_GISR0_GIF10                          ((uint32_t)0x00000400)              /*!< Channel 10 global interrupt flag */
#define MDMA_GISR0_GIF11                          ((uint32_t)0x00000800)              /*!< Channel 11 global interrupt flag */
#define MDMA_GISR0_GIF12                          ((uint32_t)0x00001000)              /*!< Channel 12 global interrupt flag */
#define MDMA_GISR0_GIF13                          ((uint32_t)0x00002000)              /*!< Channel 13 global interrupt flag */
#define MDMA_GISR0_GIF14                          ((uint32_t)0x00004000)              /*!< Channel 14 global interrupt flag */
#define MDMA_GISR0_GIF15                          ((uint32_t)0x00008000)              /*!< Channel 15 global interrupt flag */
#define MDMA_GISR0_GIF16                          ((uint32_t)0x00010000)              /*!< Channel 16 global interrupt flag */
#define MDMA_GISR0_GIF17                          ((uint32_t)0x00020000)              /*!< Channel 17 global interrupt flag */
#define MDMA_GISR0_GIF18                          ((uint32_t)0x00040000)              /*!< Channel 18 global interrupt flag */
#define MDMA_GISR0_GIF19                          ((uint32_t)0x00080000)              /*!< Channel 19 global interrupt flag */
#define MDMA_GISR0_GIF20                          ((uint32_t)0x00100000)              /*!< Channel 20 global interrupt flag */
#define MDMA_GISR0_GIF21                          ((uint32_t)0x00200000)              /*!< Channel 21 global interrupt flag */
#define MDMA_GISR0_GIF22                          ((uint32_t)0x00400000)              /*!< Channel 22 global interrupt flag */
#define MDMA_GISR0_GIF23                          ((uint32_t)0x00800000)              /*!< Channel 23 global interrupt flag */
#define MDMA_GISR0_GIF24                          ((uint32_t)0x01000000)              /*!< Channel 24 global interrupt flag */
#define MDMA_GISR0_GIF25                          ((uint32_t)0x02000000)              /*!< Channel 25 global interrupt flag */
#define MDMA_GISR0_GIF26                          ((uint32_t)0x04000000)              /*!< Channel 26 global interrupt flag */
#define MDMA_GISR0_GIF27                          ((uint32_t)0x08000000)              /*!< Channel 27 global interrupt flag */
#define MDMA_GISR0_GIF28                          ((uint32_t)0x10000000)              /*!< Channel 28 global interrupt flag */
#define MDMA_GISR0_GIF29                          ((uint32_t)0x20000000)              /*!< Channel 29 global interrupt flag */
#define MDMA_GISR0_GIF30                          ((uint32_t)0x40000000)              /*!< Channel 30 global interrupt flag */
#define MDMA_GISR0_GIF31                          ((uint32_t)0x80000000)              /*!< Channel 31 global interrupt flag */

/********************  Bit definition for MDMA_GISR1 register  ****************/
#define MDMA_GISR1_GIF32                          ((uint32_t)0x00000001)              /*!< Channel 32 global interrupt flag */
#define MDMA_GISR1_GIF33                          ((uint32_t)0x00000002)              /*!< Channel 33 global interrupt flag */
#define MDMA_GISR1_GIF34                          ((uint32_t)0x00000004)              /*!< Channel 34 global interrupt flag */
#define MDMA_GISR1_GIF35                          ((uint32_t)0x00000008)              /*!< Channel 35 global interrupt flag */
#define MDMA_GISR1_GIF36                          ((uint32_t)0x00000010)              /*!< Channel 36 global interrupt flag */
#define MDMA_GISR1_GIF37                          ((uint32_t)0x00000020)              /*!< Channel 37 global interrupt flag */
#define MDMA_GISR1_GIF38                          ((uint32_t)0x00000040)              /*!< Channel 38 global interrupt flag */
#define MDMA_GISR1_GIF39                          ((uint32_t)0x00000080)              /*!< Channel 39 global interrupt flag */
#define MDMA_GISR1_GIF40                          ((uint32_t)0x00000100)              /*!< Channel 40 global interrupt flag */
#define MDMA_GISR1_GIF41                          ((uint32_t)0x00000200)              /*!< Channel 41 global interrupt flag */
#define MDMA_GISR1_GIF42                          ((uint32_t)0x00000400)              /*!< Channel 42 global interrupt flag */
#define MDMA_GISR1_GIF43                          ((uint32_t)0x00000800)              /*!< Channel 43 global interrupt flag */
#define MDMA_GISR1_GIF44                          ((uint32_t)0x00001000)              /*!< Channel 44 global interrupt flag */
#define MDMA_GISR1_GIF45                          ((uint32_t)0x00002000)              /*!< Channel 45 global interrupt flag */
#define MDMA_GISR1_GIF46                          ((uint32_t)0x00004000)              /*!< Channel 46 global interrupt flag */
#define MDMA_GISR1_GIF47                          ((uint32_t)0x00008000)              /*!< Channel 47 global interrupt flag */
#define MDMA_GISR1_GIF48                          ((uint32_t)0x00010000)              /*!< Channel 48 global interrupt flag */
#define MDMA_GISR1_GIF49                          ((uint32_t)0x00020000)              /*!< Channel 49 global interrupt flag */
#define MDMA_GISR1_GIF50                          ((uint32_t)0x00040000)              /*!< Channel 50 global interrupt flag */
#define MDMA_GISR1_GIF51                          ((uint32_t)0x00080000)              /*!< Channel 51 global interrupt flag */
#define MDMA_GISR1_GIF52                          ((uint32_t)0x00100000)              /*!< Channel 52 global interrupt flag */
#define MDMA_GISR1_GIF53                          ((uint32_t)0x00200000)              /*!< Channel 53 global interrupt flag */
#define MDMA_GISR1_GIF54                          ((uint32_t)0x00400000)              /*!< Channel 54 global interrupt flag */
#define MDMA_GISR1_GIF55                          ((uint32_t)0x00800000)              /*!< Channel 55 global interrupt flag */
#define MDMA_GISR1_GIF56                          ((uint32_t)0x01000000)              /*!< Channel 56 global interrupt flag */
#define MDMA_GISR1_GIF57                          ((uint32_t)0x02000000)              /*!< Channel 57 global interrupt flag */
#define MDMA_GISR1_GIF58                          ((uint32_t)0x04000000)              /*!< Channel 58 global interrupt flag */
#define MDMA_GISR1_GIF59                          ((uint32_t)0x08000000)              /*!< Channel 59 global interrupt flag */
#define MDMA_GISR1_GIF60                          ((uint32_t)0x10000000)              /*!< Channel 60 global interrupt flag */
#define MDMA_GISR1_GIF61                          ((uint32_t)0x20000000)              /*!< Channel 61 global interrupt flag */
#define MDMA_GISR1_GIF62                          ((uint32_t)0x40000000)              /*!< Channel 62 global interrupt flag */

