cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/********************  Bit definition for MDMA_CxCR register  ****************/
#define MDMA_CCR_EN                              ((uint32_t)0x00000001)              /*!< Channel enable / flag channel ready when read low */
#define MDMA_CCR_TEIE                            ((uint32_t)0x00000002)              /*!< Transfer error interrupt enable */
#define MDMA_CCR_CTCIE                           ((uint32_t)0x00000004)              /*!< Channel Transfer Complete interrupt enable */
#define MDMA_CCR_BRTIE                           ((uint32_t)0x00000008)              /*!< Block Repeat transfer interrupt enable */
#define MDMA_CCR_BTIE                            ((uint32_t)0x00000010)              /*!< Block Transfer interrupt enable */
#define MDMA_CCR_TCIE                            ((uint32_t)0x00000020)              /*!< buffer Transfer Complete interrupt enable */
#define MDMA_CCR_PL                              ((uint32_t)0x000000C0)              /*!< Priority level */
#define MDMA_CCR_PL_0                            ((uint32_t)0x00000040)              /*!< Bit 0 */
#define MDMA_CCR_PL_1                            ((uint32_t)0x00000080)              /*!< Bit 1 */
#define MDMA_CCR_SM                              ((uint32_t)0x00000100)              /*!< Secure Mode Eanble */
#define MDMA_CCR_BEX                             ((uint32_t)0x00001000)              /*!< Byte Endianess eXchange */
#define MDMA_CCR_HEX                             ((uint32_t)0x00002000)              /*!< Half word Endianess eXchange */
#define MDMA_CCR_WEX                             ((uint32_t)0x00004000)              /*!< Word Endianess eXchange */
#define MDMA_CCR_SWRQ                            ((uint32_t)0x00010000)              /*!< SW ReQuest */

/********************  Bit definition for MDMA_CxTCR register  ****************/
#define MDMA_CTCR_SINC                           ((uint32_t)0x00000003)              /*!< Source increment mode */
#define MDMA_CTCR_SINC_0                         ((uint32_t)0x00000001)              /*!< Bit 0 */
#define MDMA_CTCR_SINC_1                         ((uint32_t)0x00000002)              /*!< Bit 1 */
#define MDMA_CTCR_DINC                           ((uint32_t)0x0000000C)              /*!< Source increment mode */
#define MDMA_CTCR_DINC_0                         ((uint32_t)0x00000004)              /*!< Bit 0 */
#define MDMA_CTCR_DINC_1                         ((uint32_t)0x00000008)              /*!< Bit 1 */
#define MDMA_CTCR_SSIZE                          ((uint32_t)0x00000030)              /*!< Source data size */
#define MDMA_CTCR_SSIZE_0                        ((uint32_t)0x00000010)              /*!< Bit 0 */
#define MDMA_CTCR_SSIZE_1                        ((uint32_t)0x00000020)              /*!< Bit 1 */
#define MDMA_CTCR_DSIZE                          ((uint32_t)0x000000C0)              /*!< Destination data size */
#define MDMA_CTCR_DSIZE_0                        ((uint32_t)0x00000040)              /*!< Bit 0 */
#define MDMA_CTCR_DSIZE_1                        ((uint32_t)0x00000080)              /*!< Bit 1 */
#define MDMA_CTCR_SINCOS                         ((uint32_t)0x00000300)              /*!< Source increment offset size */
#define MDMA_CTCR_SINCOS_0                       ((uint32_t)0x00000100)              /*!< Bit 0 */
#define MDMA_CTCR_SINCOS_1                       ((uint32_t)0x00000200)              /*!< Bit 1 */
#define MDMA_CTCR_DINCOS                         ((uint32_t)0x00000C00)              /*!< Destination increment offset size */
#define MDMA_CTCR_DINCOS_0                       ((uint32_t)0x00000400)              /*!< Bit 0 */
#define MDMA_CTCR_DINCOS_1                       ((uint32_t)0x00000800)              /*!< Bit 1 */
#define MDMA_CTCR_SBURST                         ((uint32_t)0x00007000)              /*!< Source burst transfer configuration */
#define MDMA_CTCR_SBURST_0                       ((uint32_t)0x00001000)              /*!< Bit 0 */
#define MDMA_CTCR_SBURST_1                       ((uint32_t)0x00002000)              /*!< Bit 1 */
#define MDMA_CTCR_SBURST_2                       ((uint32_t)0x00003000)              /*!< Bit 2 */
#define MDMA_CTCR_DBURST                         ((uint32_t)0x00038000)              /*!< Destination burst transfer configuration */
#define MDMA_CTCR_DBURST_0                       ((uint32_t)0x00008000)              /*!< Bit 0 */
#define MDMA_CTCR_DBURST_1                       ((uint32_t)0x00010000)              /*!< Bit 1 */
#define MDMA_CTCR_DBURST_2                       ((uint32_t)0x00020000)              /*!< Bit 2 */
#define MDMA_CTCR_TLEN                           ((uint32_t)0x01FC0000)              /*!< buffer Transfer Length (number of bytes - 1) */
#define MDMA_CTCR_PKE                            ((uint32_t)0x2000000)               /*!< PacK Enable */
#define MDMA_CTCR_PAM                            ((uint32_t)0xC000000)               /*!< Padding/Alignement Mode */
#define MDMA_CTCR_PAM_0                          ((uint32_t)0x4000000)               /*!< Bit 0 */
#define MDMA_CTCR_PAM_1                          ((uint32_t)0x8000000)               /*!< Bit 1 */
#define MDMA_CTCR_TRGM                           ((uint32_t)0x30000000)              /*!< Trigger Mode */
#define MDMA_CTCR_TRGM_0                         ((uint32_t)0x10000000)              /*!< Bit 0 */
#define MDMA_CTCR_TRGM_1                         ((uint32_t)0x20000000)              /*!< Bit 1 */
#define MDMA_CTCR_SWRM                           ((uint32_t)0x40000000)              /*!< SW Request Mode */
#define MDMA_CTCR_BWM                            ((uint32_t)0x80000000)              /*!< Bufferable Write Mode */

/********************  Bit definition for MDMA_CxBNDTR register  ****************/
#define MDMA_CBNDTR_BNDT                         ((uint32_t)0x0001FFFF)              /*!< Block Number of data bytes to transfer */
#define MDMA_CBNDTR_BRSUM                        ((uint32_t)0x00040000)              /*!< Block Repeat Source address Update Mode */
#define MDMA_CBNDTR_BRDUM                        ((uint32_t)0x00080000)              /*!< Block Repeat Destination address Update Mode */
#define MDMA_CBNDTR_BRC                          ((uint32_t)0xFFF00000)              /*!< Block Repeat Count */

/********************  Bit definition for MDMA_CxSAR register  ****************/
#define MDMA_CSAR_SAR                         ((uint32_t)0xFFFFFFFF)              /*!< Source address */

/********************  Bit definition for MDMA_CxDAR register  ****************/
#define MDMA_CDAR_DAR                         ((uint32_t)0xFFFFFFFF)              /*!< Destination address */

/********************  Bit definition for MDMA_CxBRUR  ************************/
#define MDMA_CBRUR_SUV                         ((uint32_t)0x0000FFFF)              /*!< Source address Update Value */
#define MDMA_CBRUR_DUV                         ((uint32_t)0xFFFF0000)              /*!< Destination address Update Value */

/********************  Bit definition for MDMA_CxLAR  *************************/
#define MDMA_CLAR_LAR                         ((uint32_t)0xFFFFFFFF)              /*!< Link Address Register */

/********************  Bit definition for MDMA_CxTBR)  ************************/
#define MDMA_CTBR_TSEL                         ((uint32_t)0x000000FF)              /*!< Trigger SELection */
#define MDMA_CTBR_SBUS                         ((uint32_t)0x00010000)              /*!< Source BUS select */
#define MDMA_CTBR_DBUS                         ((uint32_t)0x00020000)              /*!< Destination BUS select */

/********************  Bit definition for MDMA_CxMAR)  ************************/
#define MDMA_CMAR_MAR                          ((uint32_t)0xFFFFFFFF)                  /*!< Mask address */

/********************  Bit definition for MDMA_CxMDR)  ************************/
#define MDMA_CMDR_MDR                          ((uint32_t)0xFFFFFFFF)                  /*!< Mask address */

/******************************************************************************/
/*                                                                            */
/*                                     Firewall                               */
/*                                                                            */
/******************************************************************************/

/*******Bit definition for CSSA;CSL;NVDSSA;NVDSL;VDSSA;VDSL;LSSA;LSL register */
#define  FIREWALL_CSSA_ADD                        ((uint32_t)0x00FFFF00)        /*!< Code Segment Start Address */
#define  FIREWALL_CSL_LENG                        ((uint32_t)0x003FFF00)        /*!< Code Segment Length        */
#define  FIREWALL_NVDSSA_ADD                      ((uint32_t)0x00FFFF00)        /*!< Non Volatile Dat Segment Start Address */
#define  FIREWALL_NVDSL_LENG                      ((uint32_t)0x003FFF00)        /*!< Non Volatile Data Segment Length */
#define  FIREWALL_VDSSA_ADD                       ((uint32_t)0x0001FFC0)        /*!< Volatile Data Segment Start Address */
#define  FIREWALL_VDSL_LENG                       ((uint32_t)0x0001FFC0)        /*!< Volatile Data Segment Length */
#define  FIREWALL_LSSA_ADD                        ((uint32_t)0x0007FF80)        /*!< Library Segment Start Address*/
#define  FIREWALL_LSL_LENG                        ((uint32_t)0x0007FF80)        /*!< Library Segment Length*/
/**************************Bit definition for CR register *********************/
#define  FIREWALL_CR_FPA                          ((uint32_t)0x00000001)         /*!< Firewall Pre Arm*/
#define  FIREWALL_CR_VDS                          ((uint32_t)0x00000002)         /*!< Volatile Data Sharing*/
#define  FIREWALL_CR_VDE                          ((uint32_t)0x00000004)         /*!< Volatile Data Execution*/

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PWR_CR1 register  ********************/

#define  PWR_CR1_LPR                          ((uint32_t)0x00004000)     /*!< Regulator low-power mode */
#define  PWR_CR1_VOS                          ((uint32_t)0x00000600)     /*!< VOS[1:0] bits (Regulator voltage scaling output selection) */
#define  PWR_CR1_VOS_0                        ((uint32_t)0x00000200)     /*!< Bit 0 */
#define  PWR_CR1_VOS_1                        ((uint32_t)0x00000400)     /*!< Bit 1 */
#define  PWR_CR1_DBP                          ((uint32_t)0x00000100)     /*!< Disable Back-up domain Protection */
#define  PWR_CR1_LPMS                         ((uint32_t)0x00000007)     /*!< Low-power mode selection field */
#define  PWR_CR1_LPMS_STOP1MR                 ((uint32_t)0x00000000)     /*!< Stop 1 mode with Main Regulator */
#define  PWR_CR1_LPMS_STOP1LPR                ((uint32_t)0x00000001)     /*!< Stop 1 mode with Low-Power Regulator */
#define  PWR_CR1_LPMS_STOP2                   ((uint32_t)0x00000002)     /*!< Stop 2 mode */
#define  PWR_CR1_LPMS_STANDBY                 ((uint32_t)0x00000003)     /*!< Stand-by mode */


/********************  Bit definition for PWR_CR2 register  ********************/
#define  PWR_CR2_USV                          ((uint32_t)0x00000400)     /*!< VDD USB Supply Valid */
#define  PWR_CR2_IOSV                         ((uint32_t)0x00000200)     /*!< VDD IO2 independent I/Os Supply Valid */
/*!< PVME  Peripheral Voltage Monitor Enable */
#define  PWR_CR2_PVME                         ((uint32_t)0x000000F0)     /*!< PVM bits field */
#define  PWR_CR2_PVME4                        ((uint32_t)0x00000080)     /*!< PVM 4 Enable */
#define  PWR_CR2_PVME3                        ((uint32_t)0x00000040)     /*!< PVM 3 Enable */
#define  PWR_CR2_PVME2                        ((uint32_t)0x00000020)     /*!< PVM 2 Enable */
#define  PWR_CR2_PVME1                        ((uint32_t)0x00000010)     /*!< PVM 1 Enable */
/*!< PVD level configuration */
#define  PWR_CR2_PLS                          ((uint32_t)0x0000000E)     /*!< PVD level selection */
#define  PWR_CR2_PLS_LEV0                     ((uint32_t)0x00000000)     /*!< PVD level 0 */
#define  PWR_CR2_PLS_LEV1                     ((uint32_t)0x00000002)     /*!< PVD level 1 */
#define  PWR_CR2_PLS_LEV2                     ((uint32_t)0x00000004)     /*!< PVD level 2 */
#define  PWR_CR2_PLS_LEV3                     ((uint32_t)0x00000006)     /*!< PVD level 3 */
#define  PWR_CR2_PLS_LEV4                     ((uint32_t)0x00000008)     /*!< PVD level 4 */
#define  PWR_CR2_PLS_LEV5                     ((uint32_t)0x0000000A)     /*!< PVD level 5 */
#define  PWR_CR2_PLS_LEV6                     ((uint32_t)0x0000000C)     /*!< PVD level 6 */
#define  PWR_CR2_PLS_LEV7                     ((uint32_t)0x0000000E)     /*!< PVD level 7 */
#define  PWR_CR2_PVDE                         ((uint32_t)0x00000001)     /*!< Power Voltage Detector Enable */

