cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
#define  RCC_D1CFGR_D1CPRE_DIV1                 ((uint32_t)0x00000000)        /*!< Domain 1 Core clock  clock not divided */
#define  RCC_D1CFGR_D1CPRE_DIV2                 ((uint32_t)0x00000800)        /*!< Domain 1 Core clock divided by 2 */
#define  RCC_D1CFGR_D1CPRE_DIV4                 ((uint32_t)0x00000900)        /*!< Domain 1 Core clock divided by 4 */
#define  RCC_D1CFGR_D1CPRE_DIV8                 ((uint32_t)0x00000A00)        /*!< Domain 1 Core clock divided by 8 */
#define  RCC_D1CFGR_D1CPRE_DIV16                ((uint32_t)0x00000B00)        /*!< Domain 1 Core clock divided by 16 */
#define  RCC_D1CFGR_D1CPRE_DIV64                ((uint32_t)0x00000C00)        /*!< Domain 1 Core clock divided by 64 */
#define  RCC_D1CFGR_D1CPRE_DIV128               ((uint32_t)0x00000D00)        /*!< Domain 1 Core clock divided by 128 */
#define  RCC_D1CFGR_D1CPRE_DIV256               ((uint32_t)0x00000E00)        /*!< Domain 1 Core clock divided by 256 */
#define  RCC_D1CFGR_D1CPRE_DIV512               ((uint32_t)0x00000F00)        /*!< Domain 1 Core clockdivided by 512 */

/********************  Bit definition for RCC_D2CFGR register  ******************/
/*!< D2PPRE1 configuration */
#define  RCC_D2CFGR_D2PPRE1                       ((uint32_t)0x00000070)       /*!< D1PPRE1[2:0] bits (Domain2 APB1 prescaler) */
#define  RCC_D2CFGR_D2PPRE1_0                     ((uint32_t)0x00000010)       /*!<Bit 0 */
#define  RCC_D2CFGR_D2PPRE1_1                     ((uint32_t)0x00000020)       /*!<Bit 1 */
#define  RCC_D2CFGR_D2PPRE1_2                     ((uint32_t)0x00000040)       /*!<Bit 2 */

#define  RCC_D2CFGR_D2PPRE1_DIV1                  ((uint32_t)0x00000000)        /*!< Domain2 APB1 clock not divided */
#define  RCC_D2CFGR_D2PPRE1_DIV2                  ((uint32_t)0x00000040)        /*!< Domain2 APB1 clock divided by 2 */
#define  RCC_D2CFGR_D2PPRE1_DIV4                  ((uint32_t)0x00000050)        /*!< Domain2 APB1 clock divided by 4 */
#define  RCC_D2CFGR_D2PPRE1_DIV8                  ((uint32_t)0x00000060)        /*!< Domain2 APB1 clock divided by 8 */
#define  RCC_D2CFGR_D2PPRE1_DIV16                 ((uint32_t)0x00000070)        /*!< Domain2 APB1 clock divided by 16 */

/*!< D2PPRE2 configuration */
#define  RCC_D2CFGR_D2PPRE2                       ((uint32_t)0x00000700)       /*!< D2PPRE2[2:0] bits (Domain2 APB2 prescaler) */
#define  RCC_D2CFGR_D2PPRE2_0                     ((uint32_t)0x00000100)       /*!<Bit 0 */
#define  RCC_D2CFGR_D2PPRE2_1                     ((uint32_t)0x00000200)       /*!<Bit 1 */
#define  RCC_D2CFGR_D2PPRE2_2                     ((uint32_t)0x00000400)       /*!<Bit 2 */

#define  RCC_D2CFGR_D2PPRE2_DIV1                  ((uint32_t)0x00000000)        /*!< Domain2 APB2 clock not divided */
#define  RCC_D2CFGR_D2PPRE2_DIV2                  ((uint32_t)0x00000400)        /*!< Domain2 APB2 clock divided by 2 */
#define  RCC_D2CFGR_D2PPRE2_DIV4                  ((uint32_t)0x00000500)        /*!< Domain2 APB2 clock divided by 4 */
#define  RCC_D2CFGR_D2PPRE2_DIV8                  ((uint32_t)0x00000600)        /*!< Domain2 APB2 clock divided by 8 */
#define  RCC_D2CFGR_D2PPRE2_DIV16                 ((uint32_t)0x00000700)        /*!< Domain2 APB2 clock divided by 16 */

/********************  Bit definition for RCC_D3CFGR register  ******************/
/*!< D3PPRE configuration */
#define  RCC_D3CFGR_D3PPRE                       ((uint32_t)0x00000070)       /*!< D3PPRE1[2:0] bits (Domain3 APB1 prescaler) */
#define  RCC_D3CFGR_D3PPRE_0                     ((uint32_t)0x00000010)       /*!<Bit 0 */
#define  RCC_D3CFGR_D3PPRE_1                     ((uint32_t)0x00000020)       /*!<Bit 1 */
#define  RCC_D3CFGR_D3PPRE_2                     ((uint32_t)0x00000040)       /*!<Bit 2 */

#define  RCC_D3CFGR_D3PPRE_DIV1                  ((uint32_t)0x00000000)        /*!< Domain3 APB1 clock not divided */
#define  RCC_D3CFGR_D3PPRE_DIV2                  ((uint32_t)0x00000040)        /*!< Domain3 APB1 clock divided by 2 */
#define  RCC_D3CFGR_D3PPRE_DIV4                  ((uint32_t)0x00000050)        /*!< Domain3 APB1 clock divided by 4 */
#define  RCC_D3CFGR_D3PPRE_DIV8                  ((uint32_t)0x00000060)        /*!< Domain3 APB1 clock divided by 8 */
#define  RCC_D3CFGR_D3PPRE_DIV16                 ((uint32_t)0x00000070)        /*!< Domain3 APB1 clock divided by 16 */

/********************  Bit definition for RCC_CIERR register  ******************/
#define  RCC_CIER_LSIRDYIE                    ((uint32_t)0x00000001)
#define  RCC_CIER_LSERDYIE                    ((uint32_t)0x00000002)
#define  RCC_CIER_MSIRDYIE                    ((uint32_t)0x00000004)
#define  RCC_CIER_HSIRDYIE                    ((uint32_t)0x00000008)
#define  RCC_CIER_HSERDYIE                    ((uint32_t)0x00000010)
#define  RCC_CIER_PLLRDYIE                    ((uint32_t)0x00000020)
#define  RCC_CIER_PLLSAI1RDYIE                ((uint32_t)0x00000040)
#define  RCC_CIER_PLLSAI2RDYIE                ((uint32_t)0x00000080)
#define  RCC_CIER_LSECSSIE                    ((uint32_t)0x00000200)

/********************  Bit definition for RCC_CIFR register  ******************/
#define  RCC_CIER_LSIRDYF                     ((uint32_t)0x00000001)
#define  RCC_CIER_LSERDYF                     ((uint32_t)0x00000002)
#define  RCC_CIER_MSIRDYF                     ((uint32_t)0x00000004)
#define  RCC_CIER_HSIRDYF                     ((uint32_t)0x00000008)
#define  RCC_CIER_HSERDYF                     ((uint32_t)0x00000010)
#define  RCC_CIER_PLLRDYF                     ((uint32_t)0x00000020)
#define  RCC_CIER_PLLSAI1RDYF                 ((uint32_t)0x00000040)
#define  RCC_CIER_PLLSAI2RDYF                 ((uint32_t)0x00000080)
#define  RCC_CIER_HSECSSF                     ((uint32_t)0x00000100)
#define  RCC_CIER_LSECSSF                     ((uint32_t)0x00000200)

/********************  Bit definition for RCC_CICR register  ******************/
#define  RCC_CIER_LSIRDYC                     ((uint32_t)0x00000001)
#define  RCC_CIER_LSERDYC                     ((uint32_t)0x00000002)
#define  RCC_CIER_MSIRDYC                     ((uint32_t)0x00000004)
#define  RCC_CIER_HSIRDYC                     ((uint32_t)0x00000008)
#define  RCC_CIER_HSERDYC                     ((uint32_t)0x00000010)
#define  RCC_CIER_PLLRDYC                     ((uint32_t)0x00000020)
#define  RCC_CIER_PLLSAI1RDYC                 ((uint32_t)0x00000040)
#define  RCC_CIER_PLLSAI2RDYC                 ((uint32_t)0x00000080)
#define  RCC_CIER_HSECSSC                     ((uint32_t)0x00000100)
#define  RCC_CIER_CSSC                        ((uint32_t)0x00000200)

/********************  Bit definition for RCC_D1CCIPR register  ***************/
#define  RCC_D1CCIPR_FMCSEL              		 	 ((uint32_t)0x00000003)
#define  RCC_D1CCIPR_FMCSEL_0                  ((uint32_t)0x00000001)
#define  RCC_D1CCIPR_FMCSEL_1                  ((uint32_t)0x00000002)
#define  RCC_D1CCIPR_QSPISEL              		 ((uint32_t)0x00000030)
#define  RCC_D1CCIPR_QSPISEL_0                 ((uint32_t)0x00000010)
#define  RCC_D1CCIPR_QSPISEL_1                 ((uint32_t)0x00000020)
#define  RCC_D2CCIPR_DSISEL              		   ((uint32_t)0x00000100)
#define  RCC_D2CCIPR_SDMMCSEL              		 ((uint32_t)0x00010000)
#define  RCC_D2CCIPR_CKPERSEL              		 ((uint32_t)0x30000000)
#define  RCC_D2CCIPR_CKPERSEL_0              	 ((uint32_t)0x10000000)
#define  RCC_D2CCIPR_CKPERSEL_1              	 ((uint32_t)0x20000000)

/********************  Bit definition for RCC_D2CCIP1R register  ***************/
#define  RCC_D2CCIP1R_SAI1SEL              		 ((uint32_t)0x00000007)
#define  RCC_D2CCIP1R_SAI1SEL_0                ((uint32_t)0x00000001)
#define  RCC_D2CCIP1R_SAI1SEL_1                ((uint32_t)0x00000002)
#define  RCC_D2CCIP1R_SAI1SEL_2                ((uint32_t)0x00000004)

#define  RCC_D2CCIP1R_SAI23SEL              	 ((uint32_t)0x000000E0)
#define  RCC_D2CCIP1R_SAI23SEL_0               ((uint32_t)0x00000020)
#define  RCC_D2CCIP1R_SAI23SEL_1               ((uint32_t)0x00000040)
#define  RCC_D2CCIP1R_SAI23SEL_2               ((uint32_t)0x00000080)

