cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
#define  RCC_D2CCIP1R_SPI123SEL              	 ((uint32_t)0x00007000)
#define  RCC_D2CCIP1R_SPI123SEL_0              ((uint32_t)0x00001000)
#define  RCC_D2CCIP1R_SPI123SEL_1              ((uint32_t)0x00002000)
#define  RCC_D2CCIP1R_SPI123SEL_2              ((uint32_t)0x00004000)

#define  RCC_D2CCIP1R_SPI45SEL              	 ((uint32_t)0x00070000)
#define  RCC_D2CCIP1R_SPI45SEL_0               ((uint32_t)0x00010000)
#define  RCC_D2CCIP1R_SPI45SEL_1               ((uint32_t)0x00020000)
#define  RCC_D2CCIP1R_SPI45SEL_2               ((uint32_t)0x00040000)

#define  RCC_D2CCIP1R_SPDIFSEL              	 ((uint32_t)0x00300000)
#define  RCC_D2CCIP1R_SPDIFSEL_0               ((uint32_t)0x00100000)
#define  RCC_D2CCIP1R_SPDIFSEL_1               ((uint32_t)0x00200000)

#define  RCC_D2CCIP1R_DFSDMSEL              	 ((uint32_t)0x01000000)

#define  RCC_D2CCIP1R_FDCANSEL              	 ((uint32_t)0x30000000)
#define  RCC_D2CCIP1R_FDCANSEL_0               ((uint32_t)0x10000000)
#define  RCC_D2CCIP1R_FDCANSEL_1               ((uint32_t)0x20000000)

#define  RCC_D2CCIP1R_FDCANSEL              	 ((uint32_t)0x30000000)
#define  RCC_D2CCIP1R_SWPSEL              	   ((uint32_t)0x80000000)

/********************  Bit definition for RCC_D2CCIP2R register  ***************/
#define  RCC_D2CCIP2R_USART16SEL               ((uint32_t)0x00000038)
#define  RCC_D2CCIP2R_USART16SEL_0             ((uint32_t)0x00000008)
#define  RCC_D2CCIP2R_USART16SEL_1             ((uint32_t)0x00000010)
#define  RCC_D2CCIP2R_USART16SEL_2             ((uint32_t)0x00000020)

#define  RCC_D2CCIP2R_USART28SEL               ((uint32_t)0x00000007)
#define  RCC_D2CCIP2R_USART28SEL_0             ((uint32_t)0x00000001)
#define  RCC_D2CCIP2R_USART28SEL_1             ((uint32_t)0x00000002)
#define  RCC_D2CCIP2R_USART28SEL_2             ((uint32_t)0x00000004)

#define  RCC_D2CCIP2R_CECSEL                   ((uint32_t)0x00C00000)
#define  RCC_D2CCIP2R_CECSEL_0                 ((uint32_t)0x00400000)
#define  RCC_D2CCIP2R_CECSEL_1                 ((uint32_t)0x00800000)

#define  RCC_D2CCIP2R_I2C123SEL                ((uint32_t)0x00003000)
#define  RCC_D2CCIP2R_I2C123SEL_0              ((uint32_t)0x00001000)
#define  RCC_D2CCIP2R_I2C123SEL_1              ((uint32_t)0x00002000)


/********************  Bit definition for RCC_D3CCIPR register  ***************/
#define  RCC_D3CCIPR_LPUART1SEL               ((uint32_t)0x00000007)
#define  RCC_D3CCIPR_LPUART1SEL_0             ((uint32_t)0x00000001)
#define  RCC_D3CCIPR_LPUART1SEL_1             ((uint32_t)0x00000002)
#define  RCC_D3CCIPR_LPUART1SEL_2             ((uint32_t)0x00000004)

#define  RCC_D3CCIPR_I2C4SEL                  ((uint32_t)0x00000300)
#define  RCC_D3CCIPR_I2C4SEL_0                ((uint32_t)0x00000100)
#define  RCC_D3CCIPR_I2C4SEL_1                ((uint32_t)0x00000200)

#define  RCC_D3CCIPR_SAI4ASEL                  ((uint32_t)0x00E00000)
#define  RCC_D3CCIPR_SAI4ASEL_0                ((uint32_t)0x00800000)
#define  RCC_D3CCIPR_SAI4ASEL_1                ((uint32_t)0x00400000)
#define  RCC_D3CCIPR_SAI4ASEL_2                ((uint32_t)0x00200000)

#define  RCC_D3CCIPR_SAI4BSEL                  ((uint32_t)0x07000000)
#define  RCC_D3CCIPR_SAI4BSEL_0                ((uint32_t)0x04000000)
#define  RCC_D3CCIPR_SAI4BSEL_1                ((uint32_t)0x02000000)
#define  RCC_D3CCIPR_SAI4BSEL_2                ((uint32_t)0x01000000)

/********************  Bit definition for RCC_D1AHB1ENR register  **************/
#define  RCC_D1AHB1ENR_MDMAEN                 ((uint32_t)0x00000001)
#define  RCC_D1AHB1ENR_DMA2DEN                 ((uint32_t)0x00000010)
#define  RCC_D1AHB1ENR_JPGDECEN                ((uint32_t)0x00000020)
#define  RCC_D1AHB1ENR_FLASHEN                 ((uint32_t)0x00000100)
#define  RCC_D1AHB1ENR_FMCEN                   ((uint32_t)0x00001000)
#define  RCC_D1AHB1ENR_QSPIEN                  ((uint32_t)0x00004000)
#define  RCC_D1AHB1ENR_SDMMC1EN                ((uint32_t)0x00010000)
#define  RCC_D1AHB1ENR_DTCM1EN                 ((uint32_t)0x10000000)
#define  RCC_D1AHB1ENR_DTCM2EN                 ((uint32_t)0x20000000)
#define  RCC_D1AHB1ENR_ITCMEN                  ((uint32_t)0x40000000)
#define  RCC_D1AHB1ENR_D1SRAM1EN               ((uint32_t)0x80000000)


/********************  Bit definition for RCC_D2AHB1ENR register  ***************/
#define  RCC_D2AHB1ENR_DMA1EN                    ((uint32_t)0x00000001)
#define  RCC_D2AHB1ENR_DMA2EN                    ((uint32_t)0x00000002)
#define  RCC_D2AHB1ENR_ADC12EN                   ((uint32_t)0x00000020)
#define  RCC_D2AHB1ENR_ARTEN                     ((uint32_t)0x00004000)
#define  RCC_D2AHB1ENR_ETH1MACEN                 ((uint32_t)0x00008000)
#define  RCC_D2AHB1ENR_ETH1TXEN                  ((uint32_t)0x00010000)
#define  RCC_D2AHB1ENR_ETH1RXEN                  ((uint32_t)0x00020000)
#define  RCC_D2AHB1ENR_ETH1PTPEN                 ((uint32_t)0x00040000)
#define  RCC_D2AHB1ENR_USB1OTGHSEN               ((uint32_t)0x02000000)
#define  RCC_D2AHB1ENR_USB1OTGHSULPIEN           ((uint32_t)0x04000000)
#define  RCC_D2AHB1ENR_USB2OTGHSEN               ((uint32_t)0x08000000)
#define  RCC_D2AHB1ENR_USB2OTGHSULPIEN           ((uint32_t)0x10000000)

/********************  Bit definition for RCC_D2AHB2ENR register  ***************/
#define  RCC_D2AHB2ENR_DCMIEN                   ((uint32_t)0x00000001)
#define  RCC_D2AHB2ENR_CRYPEN                  ((uint32_t)0x00000010)
#define  RCC_D2AHB2ENR_HASHEN                   ((uint32_t)0x00000020)
#define  RCC_D2AHB2ENR_RNGEN                    ((uint32_t)0x00000040)
#define  RCC_D2AHB2ENR_SDMMC2EN                 ((uint32_t)0x00000200)
#define  RCC_D2AHB2ENR_D2SRAM1EN                ((uint32_t)0x40000000)
#define  RCC_D2AHB2ENR_D2SRAM2EN                ((uint32_t)0x40000000)
#define  RCC_D2AHB2ENR_D2SRAM3EN                ((uint32_t)0x80000000)


/********************  Bit definition for D3AHB1ENR register  ******************/
#define  RCC_D3AHB1ENR_GPIOAEN                 ((uint32_t)0x00000001)
#define  RCC_D3AHB1ENR_GPIOBEN                 ((uint32_t)0x00000002)
#define  RCC_D3AHB1ENR_GPIOCEN                 ((uint32_t)0x00000004)
#define  RCC_D3AHB1ENR_GPIODEN                 ((uint32_t)0x00000008)
#define  RCC_D3AHB1ENR_GPIOEEN                 ((uint32_t)0x00000010)
#define  RCC_D3AHB1ENR_GPIOFEN                 ((uint32_t)0x00000020)
#define  RCC_D3AHB1ENR_GPIOGEN                 ((uint32_t)0x00000040)
#define  RCC_D3AHB1ENR_GPIOHEN                 ((uint32_t)0x00000080)
#define  RCC_D3AHB1ENR_GPIOIEN                 ((uint32_t)0x00000100)
#define  RCC_D3AHB1ENR_GPIOJEN                 ((uint32_t)0x00000200)
#define  RCC_D3AHB1ENR_GPIOKEN                 ((uint32_t)0x00000400)
#define  RCC_D3AHB1ENR_PWREN                   ((uint32_t)0x00040000)
#define  RCC_D3AHB1ENR_CRCEN                   ((uint32_t)0x00080000)
#define  RCC_D3AHB1ENR_DMA3EN                  ((uint32_t)0x00200000)
#define  RCC_D3AHB1ENR_ADC3EN                  ((uint32_t)0x01000000)
#define  RCC_D3AHB1ENR_HSEMEN                  ((uint32_t)0x02000000)
#define  RCC_D3AHB1ENR_BKPRAMEN                ((uint32_t)0x10000000)
#define  RCC_D3AHB1ENR_D3SRAM1EN               ((uint32_t)0x20000000)

