cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/********************  Bit definition for D1APB1ENR register  ******************/

#define  RCC_D1APB1ENR_LTDCEN                 ((uint32_t)0x00000008)
#define  RCC_D1APB1ENR_DSIEN                  ((uint32_t)0x00000010)
#define  RCC_D1APB1ENR_WWDG1EN                ((uint32_t)0x00000040)

/********************  Bit definition for D2APB1LENR register  ******************/

#define  RCC_D2APB1LENR_TIM2EN                 ((uint32_t)0x00000001)
#define  RCC_D2APB1LENR_TIM3EN                 ((uint32_t)0x00000002)
#define  RCC_D2APB1LENR_TIM4EN                 ((uint32_t)0x00000004)
#define  RCC_D2APB1LENR_TIM5EN                 ((uint32_t)0x00000008)
#define  RCC_D2APB1LENR_TIM6EN                 ((uint32_t)0x00000010)
#define  RCC_D2APB1LENR_TIM7EN                 ((uint32_t)0x00000020)
#define  RCC_D2APB1LENR_TIM12EN                ((uint32_t)0x00000040)
#define  RCC_D2APB1LENR_TIM13EN                ((uint32_t)0x00000080)
#define  RCC_D2APB1LENR_TIM14EN                ((uint32_t)0x00000100)
#define  RCC_D2APB1LENR_LPTIM1EN               ((uint32_t)0x00000200)
#define  RCC_D2APB1LENR_WWDG2EN                ((uint32_t)0x00000800)
#define  RCC_D2APB1LENR_SPI2EN                 ((uint32_t)0x00004000)
#define  RCC_D2APB1LENR_SPI3EN                 ((uint32_t)0x00008000)
#define  RCC_D2APB1LENR_SPDIFRXEN              ((uint32_t)0x00010000)
#define  RCC_D2APB1LENR_USART2EN               ((uint32_t)0x00020000)
#define  RCC_D2APB1LENR_USART3EN               ((uint32_t)0x00040000)
#define  RCC_D2APB1LENR_UART4EN                ((uint32_t)0x00080000)
#define  RCC_D2APB1LENR_UART5EN                ((uint32_t)0x00100000)
#define  RCC_D2APB1LENR_I2C1EN                 ((uint32_t)0x00200000)
#define  RCC_D2APB1LENR_I2C2EN                 ((uint32_t)0x00400000)
#define  RCC_D2APB1LENR_I2C3EN                 ((uint32_t)0x00800000)
#define  RCC_D2APB1LENR_CECEN                  ((uint32_t)0x08000000)
#define  RCC_D2APB1LENR_DAC12EN                ((uint32_t)0x20000000)
#define  RCC_D2APB1LENR_USART7EN               ((uint32_t)0x40000000)
#define  RCC_D2APB1LENR_USART8EN               ((uint32_t)0x80000000)

/********************  Bit definition for D2APB1HENR register  ******************/
#define  RCC_D2APB1HENR_CRSEN                  ((uint32_t)0x00000002)
#define  RCC_D2APB1HENR_SWPMIEN                ((uint32_t)0x00000004)
#define  RCC_D2APB1HENR_OPAMPEN                ((uint32_t)0x00000010)
#define  RCC_D2APB1HENR_MDIOSEN                ((uint32_t)0x00000020)
#define  RCC_D2APB1HENR_FDCANEN                ((uint32_t)0x00000100)

/********************  Bit definition for D2APB2ENR register  ******************/
#define  RCC_D2APB2ENR_TIM1EN                  ((uint32_t)0x00000001)
#define  RCC_D2APB2ENR_TIM8EN                  ((uint32_t)0x00000002)
#define  RCC_D2APB2ENR_USART1EN                ((uint32_t)0x00000010)
#define  RCC_D2APB2ENR_USART6EN                ((uint32_t)0x00000020)
#define  RCC_D2APB2ENR_SPI1EN                  ((uint32_t)0x00001000)
#define  RCC_D2APB2ENR_SPI4EN                  ((uint32_t)0x00002000)
#define  RCC_D2APB2ENR_TIM15EN                 ((uint32_t)0x00010000)
#define  RCC_D2APB2ENR_TIM16EN                 ((uint32_t)0x00020000)
#define  RCC_D2APB2ENR_TIM17EN                 ((uint32_t)0x00040000)
#define  RCC_D2APB2ENR_SPI5EN                  ((uint32_t)0x00100000)
#define  RCC_D2APB2ENR_SAI1EN                  ((uint32_t)0x00400000)
#define  RCC_D2APB2ENR_SAI2EN                  ((uint32_t)0x00800000)
#define  RCC_D2APB2ENR_SAI3EN                  ((uint32_t)0x01000000)
#define  RCC_D2APB2ENR_DFSDMEN                 ((uint32_t)0x10000000)
#define  RCC_D2APB2ENR_HRTIMEN                 ((uint32_t)0x20000000)

/********************  Bit definition for D3APB1ENR register  ******************/
#define  RCC_D3APB1ENR_SYSCFGEN                ((uint32_t)0x00000002)
#define  RCC_D3APB1ENR_LPUART1EN               ((uint32_t)0x00000008)
#define  RCC_D3APB1ENR_SPI6EN                  ((uint32_t)0x00000020)
#define  RCC_D3APB1ENR_I2C4EN                  ((uint32_t)0x00000080)
#define  RCC_D3APB1ENR_LPTIM2EN                ((uint32_t)0x00000200)
#define  RCC_D3APB1ENR_LPTIM3EN                ((uint32_t)0x00000400)
#define  RCC_D3APB1ENR_LPTIM4EN                ((uint32_t)0x00000800)
#define  RCC_D3APB1ENR_LPTIM5EN                ((uint32_t)0x00001000)
#define  RCC_D3APB1ENR_COMP12EN                ((uint32_t)0x00004000)
#define  RCC_D3APB1ENR_SAI4EN                  ((uint32_t)0x00200000)

/********************  Bit definition for RCC_D1AHB1RSTR register  ***************/
#define  RCC_D1AHB1RSTR_MDMARST                 ((uint32_t)0x00000001)
#define  RCC_D1AHB1RSTR_DMA2DRST                 ((uint32_t)0x00000010)
#define  RCC_D1AHB1RSTR_JPGDECRST                ((uint32_t)0x00000020)
#define  RCC_D1AHB1RSTR_FMCRST                   ((uint32_t)0x00001000)
#define  RCC_D1AHB1RSTR_QSPIRST                  ((uint32_t)0x00004000)
#define  RCC_D1AHB1RSTR_SDMMC1RST                ((uint32_t)0x00010000)
#define  RCC_D1AHB1RSTR_CPU1RST                  ((uint32_t)0x80000000)


/********************  Bit definition for RCC_D2AHB1RSTR register  ***************/
#define  RCC_D2AHB1RSTR_DMA1RST                    ((uint32_t)0x00000001)
#define  RCC_D2AHB1RSTR_DMA2RST                    ((uint32_t)0x00000002)
#define  RCC_D2AHB1RSTR_DMAMUX1RST                 ((uint32_t)0x00000004)
#define  RCC_D2AHB1RSTR_ADC12RST                   ((uint32_t)0x00000020)
#define  RCC_D2AHB1RSTR_ARTRST                     ((uint32_t)0x00004000)
#define  RCC_D2AHB1RSTR_ETH1MACRST                 ((uint32_t)0x00008000)
#define  RCC_D2AHB1RSTR_USB1OTGHSRST               ((uint32_t)0x02000000)
#define  RCC_D2AHB1RSTR_USB2OTGHSRST               ((uint32_t)0x08000000)
#define  RCC_D2AHB1RSTR_CPU2RST                   ((uint32_t)0x80000000)

/********************  Bit definition for RCC_D2AHB2RSTR register  ***************/
#define  RCC_D2AHB2RSTR_DCMIRST                   ((uint32_t)0x00000001)
#define  RCC_D2AHB2RSTR_CRYPRST                  ((uint32_t)0x00000010)
#define  RCC_D2AHB2RSTR_HASHRST                   ((uint32_t)0x00000020)
#define  RCC_D2AHB2RSTR_RNGRST                    ((uint32_t)0x00000040)
#define  RCC_D2AHB2RSTR_SDMMC2RST                 ((uint32_t)0x00000200)

/********************  Bit definition for D3AHB1RSTR register  ******************/
#define  RCC_D3AHB1RSTR_GPIOARST                 ((uint32_t)0x00000001)
#define  RCC_D3AHB1RSTR_GPIOBRST                 ((uint32_t)0x00000002)
#define  RCC_D3AHB1RSTR_GPIOCRST                 ((uint32_t)0x00000004)
#define  RCC_D3AHB1RSTR_GPIODRST                 ((uint32_t)0x00000008)
#define  RCC_D3AHB1RSTR_GPIOERST                 ((uint32_t)0x00000010)
#define  RCC_D3AHB1RSTR_GPIOFRST                 ((uint32_t)0x00000020)
#define  RCC_D3AHB1RSTR_GPIOGRST                 ((uint32_t)0x00000040)
#define  RCC_D3AHB1RSTR_GPIOHRST                 ((uint32_t)0x00000080)
#define  RCC_D3AHB1RSTR_GPIOIRST                 ((uint32_t)0x00000100)
#define  RCC_D3AHB1RSTR_GPIOJRST                 ((uint32_t)0x00000200)
#define  RCC_D3AHB1RSTR_GPIOKRST                 ((uint32_t)0x00000400)
#define  RCC_D3AHB1RSTR_PWRRST                   ((uint32_t)0x00040000)
#define  RCC_D3AHB1RSTR_CRCRST                   ((uint32_t)0x00080000)
#define  RCC_D3AHB1RSTR_DMA3RST                  ((uint32_t)0x00200000)
#define  RCC_D3AHB1RSTR_DMAMUX2RST               ((uint32_t)0x00400000)
#define  RCC_D3AHB1RSTR_ADC3RST                  ((uint32_t)0x01000000)
#define  RCC_D3AHB1RSTR_HSEMRST                  ((uint32_t)0x02000000)


/********************  Bit definition for D1APB1RSTR register  ******************/

#define  RCC_D1APB1RSTR_LTDCRST                 ((uint32_t)0x00000008)
#define  RCC_D1APB1RSTR_DSIRST                  ((uint32_t)0x00000010)

