cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/********************  Bit definition for D2APB1LRSTR register  ******************/

#define  RCC_D2APB1LRSTR_TIM2RST                 ((uint32_t)0x00000001)
#define  RCC_D2APB1LRSTR_TIM3RST                 ((uint32_t)0x00000002)
#define  RCC_D2APB1LRSTR_TIM4RST                 ((uint32_t)0x00000004)
#define  RCC_D2APB1LRSTR_TIM5RST                 ((uint32_t)0x00000008)
#define  RCC_D2APB1LRSTR_TIM6RST                 ((uint32_t)0x00000010)
#define  RCC_D2APB1LRSTR_TIM7RST                 ((uint32_t)0x00000020)
#define  RCC_D2APB1LRSTR_TIM12RST                ((uint32_t)0x00000040)
#define  RCC_D2APB1LRSTR_TIM13RST                ((uint32_t)0x00000080)
#define  RCC_D2APB1LRSTR_TIM14RST                ((uint32_t)0x00000100)
#define  RCC_D2APB1LRSTR_LPTIM1RST               ((uint32_t)0x00000200)
#define  RCC_D2APB1LRSTR_SPI2RST                 ((uint32_t)0x00004000)
#define  RCC_D2APB1LRSTR_SPI3RST                 ((uint32_t)0x00008000)
#define  RCC_D2APB1LRSTR_SPDIFRXRST              ((uint32_t)0x00010000)
#define  RCC_D2APB1LRSTR_USART2RST               ((uint32_t)0x00020000)
#define  RCC_D2APB1LRSTR_USART3RST               ((uint32_t)0x00040000)
#define  RCC_D2APB1LRSTR_UART4RST                ((uint32_t)0x00080000)
#define  RCC_D2APB1LRSTR_UART5RST                ((uint32_t)0x00100000)
#define  RCC_D2APB1LRSTR_I2C1RST                 ((uint32_t)0x00200000)
#define  RCC_D2APB1LRSTR_I2C2RST                 ((uint32_t)0x00400000)
#define  RCC_D2APB1LRSTR_I2C3RST                 ((uint32_t)0x00800000)
#define  RCC_D2APB1LRSTR_CECRST                  ((uint32_t)0x08000000)
#define  RCC_D2APB1LRSTR_DAC12RST                ((uint32_t)0x20000000)
#define  RCC_D2APB1LRSTR_USART7RST               ((uint32_t)0x40000000)
#define  RCC_D2APB1LRSTR_USART8RST               ((uint32_t)0x80000000)

/********************  Bit definition for D2APB1HRSTR register  ******************/
#define  RCC_D2APB1HRSTR_CRSRST                  ((uint32_t)0x00000002)
#define  RCC_D2APB1HRSTR_SWPMIRST                ((uint32_t)0x00000004)
#define  RCC_D2APB1HRSTR_OPAMPRST                ((uint32_t)0x00000010)
#define  RCC_D2APB1HRSTR_MDIOSRST                ((uint32_t)0x00000020)
#define  RCC_D2APB1HRSTR_FDCANRST                ((uint32_t)0x00000100)

/********************  Bit definition for D2APB2RSTR register  ******************/
#define  RCC_D2APB2RSTR_TIM1RST                  ((uint32_t)0x00000001)
#define  RCC_D2APB2RSTR_TIM8RST                  ((uint32_t)0x00000002)
#define  RCC_D2APB2RSTR_USART1RST                ((uint32_t)0x00000010)
#define  RCC_D2APB2RSTR_USART6RST                ((uint32_t)0x00000020)
#define  RCC_D2APB2RSTR_SPI1RST                  ((uint32_t)0x00001000)
#define  RCC_D2APB2RSTR_SPI4RST                  ((uint32_t)0x00002000)
#define  RCC_D2APB2RSTR_TIM15RST                 ((uint32_t)0x00010000)
#define  RCC_D2APB2RSTR_TIM16RST                 ((uint32_t)0x00020000)
#define  RCC_D2APB2RSTR_TIM17RST                 ((uint32_t)0x00040000)
#define  RCC_D2APB2RSTR_SPI5RST                  ((uint32_t)0x00100000)
#define  RCC_D2APB2RSTR_SAI1RST                  ((uint32_t)0x00400000)
#define  RCC_D2APB2RSTR_SAI2RST                  ((uint32_t)0x00800000)
#define  RCC_D2APB2RSTR_SAI3RST                  ((uint32_t)0x01000000)
#define  RCC_D2APB2RSTR_DFSDMRST                 ((uint32_t)0x10000000)
#define  RCC_D2APB2RSTR_HRTIMRST                 ((uint32_t)0x20000000)

/********************  Bit definition for D3APB1RSTR register  ******************/
#define  RCC_D3APB1RSTR_SYSCFGRST                ((uint32_t)0x00000002)
#define  RCC_D3APB1RSTR_LPUART1RST               ((uint32_t)0x00000008)
#define  RCC_D3APB1RSTR_SPI6RST                  ((uint32_t)0x00000020)
#define  RCC_D3APB1RSTR_I2C4RST                  ((uint32_t)0x00000080)
#define  RCC_D3APB1RSTR_LPTIM2RST                ((uint32_t)0x00000200)
#define  RCC_D3APB1RSTR_LPTIM3RST                ((uint32_t)0x00000400)
#define  RCC_D3APB1RSTR_LPTIM4RST                ((uint32_t)0x00000800)
#define  RCC_D3APB1RSTR_LPTIM5RST                ((uint32_t)0x00001000)
#define  RCC_D3APB1RSTR_COMP12RST                ((uint32_t)0x00004000)
#define  RCC_D3APB1RSTR_SAI4RST                  ((uint32_t)0x00200000)

/********************  Bit definition for RCC_D1AHB1ENR register  **************/
#define  RCC_D1AHB1SMENR_MDMASMEN                 ((uint32_t)0x00000001)
#define  RCC_D1AHB1SMENR_DMA2DSMEN                 ((uint32_t)0x00000010)
#define  RCC_D1AHB1SMENR_JPGDECSMEN                ((uint32_t)0x00000020)
#define  RCC_D1AHB1SMENR_FLASHSMEN                 ((uint32_t)0x00000100)
#define  RCC_D1AHB1SMENR_FMCSMEN                   ((uint32_t)0x00001000)
#define  RCC_D1AHB1SMENR_QSPISMEN                  ((uint32_t)0x00004000)
#define  RCC_D1AHB1SMENR_SDMMC1SMEN                ((uint32_t)0x00010000)
#define  RCC_D1AHB1SMENR_DTCM1SMEN                 ((uint32_t)0x10000000)
#define  RCC_D1AHB1SMENR_DTCM2SMEN                 ((uint32_t)0x20000000)
#define  RCC_D1AHB1SMENR_ITCMSMEN                  ((uint32_t)0x40000000)
#define  RCC_D1AHB1SMENR_D1SRAM1SMEN               ((uint32_t)0x80000000)


/********************  Bit definition for RCC_D2AHB1SMENR register  ***************/
#define  RCC_D2AHB1SMENR_DMA1SMEN                    ((uint32_t)0x00000001)
#define  RCC_D2AHB1SMENR_DMA2SMEN                    ((uint32_t)0x00000002)
#define  RCC_D2AHB1SMENR_ADC12SMEN                   ((uint32_t)0x00000020)
#define  RCC_D2AHB1SMENR_ARTSMEN                     ((uint32_t)0x00004000)
#define  RCC_D2AHB1SMENR_ETH1MACSMEN                 ((uint32_t)0x00008000)
#define  RCC_D2AHB1SMENR_ETH1TXSMEN                  ((uint32_t)0x00010000)
#define  RCC_D2AHB1SMENR_ETH1RXSMEN                  ((uint32_t)0x00020000)
#define  RCC_D2AHB1SMENR_ETH1PTPSMEN                 ((uint32_t)0x00040000)
#define  RCC_D2AHB1SMENR_USB1OTGHSSMEN               ((uint32_t)0x02000000)
#define  RCC_D2AHB1SMENR_USB1OTGHSULPISMEN           ((uint32_t)0x04000000)
#define  RCC_D2AHB1SMENR_USB2OTGHSSMEN               ((uint32_t)0x08000000)
#define  RCC_D2AHB1SMENR_USB2OTGHSULPISMEN           ((uint32_t)0x10000000)

/********************  Bit definition for RCC_D2AHB2SMENR register  ***************/
#define  RCC_D2AHB2SMENR_DCMISMEN                   ((uint32_t)0x00000001)
#define  RCC_D2AHB2SMENR_CRYPSMEN                  ((uint32_t)0x00000010)
#define  RCC_D2AHB2SMENR_HASHSMEN                   ((uint32_t)0x00000020)
#define  RCC_D2AHB2SMENR_RNGSMEN                    ((uint32_t)0x00000040)
#define  RCC_D2AHB2SMENR_SDMMC2SMEN                 ((uint32_t)0x00000200)
#define  RCC_D2AHB2SMENR_D2SRAM1SMEN                ((uint32_t)0x40000000)
#define  RCC_D2AHB2SMENR_D2SRAM2SMEN                ((uint32_t)0x40000000)
#define  RCC_D2AHB2SMENR_D2SRAM3SMEN                ((uint32_t)0x80000000)


/********************  Bit definition for D3AHB1SMENR register  ******************/
#define  RCC_D3AHB1SMENR_GPIOASMEN                 ((uint32_t)0x00000001)
#define  RCC_D3AHB1SMENR_GPIOBSMEN                 ((uint32_t)0x00000002)
#define  RCC_D3AHB1SMENR_GPIOCSMEN                 ((uint32_t)0x00000004)
#define  RCC_D3AHB1SMENR_GPIODSMEN                 ((uint32_t)0x00000008)
#define  RCC_D3AHB1SMENR_GPIOESMEN                 ((uint32_t)0x00000010)
#define  RCC_D3AHB1SMENR_GPIOFSMEN                 ((uint32_t)0x00000020)
#define  RCC_D3AHB1SMENR_GPIOGSMEN                 ((uint32_t)0x00000040)
#define  RCC_D3AHB1SMENR_GPIOHSMEN                 ((uint32_t)0x00000080)
#define  RCC_D3AHB1SMENR_GPIOISMEN                 ((uint32_t)0x00000100)
#define  RCC_D3AHB1SMENR_GPIOJSMEN                 ((uint32_t)0x00000200)
#define  RCC_D3AHB1SMENR_GPIOKSMEN                 ((uint32_t)0x00000400)
#define  RCC_D3AHB1SMENR_PWRSMEN                   ((uint32_t)0x00040000)
#define  RCC_D3AHB1SMENR_CRCSMEN                   ((uint32_t)0x00080000)
#define  RCC_D3AHB1SMENR_DMA3SMEN                  ((uint32_t)0x00200000)
#define  RCC_D3AHB1SMENR_ADC3SMEN                  ((uint32_t)0x01000000)
#define  RCC_D3AHB1SMENR_BKPRAMSMEN                ((uint32_t)0x10000000)
#define  RCC_D3AHB1SMENR_D3SRAM1SMEN               ((uint32_t)0x20000000)

/********************  Bit definition for D1APB1SMENR register  ******************/

#define  RCC_D1APB1SMENR_LTDCSMEN                 ((uint32_t)0x00000008)
#define  RCC_D1APB1SMENR_DSISMEN                  ((uint32_t)0x00000010)
#define  RCC_D1APB1SMENR_WWDG1SMEN                ((uint32_t)0x00000040)

/********************  Bit definition for D2APB1LSMENR register  ******************/

