cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Flash/STM32H7xx_CM4/inc/stm32h776xx.h
/******************  Bit definition for LPTIM_CFGR register *******************/
#define  LPTIM_CFGR_CKSEL                       ((uint32_t)0x00000001)             /*!< Clock selector */

#define  LPTIM_CFGR_CKPOL                       ((uint32_t)0x00000006)             /*!< CKPOL[1:0] bits (Clock polarity) */
#define  LPTIM_CFGR_CKPOL_0                     ((uint32_t)0x00000002)             /*!< Bit 0 */
#define  LPTIM_CFGR_CKPOL_1                     ((uint32_t)0x00000004)             /*!< Bit 1 */

#define  LPTIM_CFGR_CKFLT                       ((uint32_t)0x00000018)             /*!< CKFLT[1:0] bits (Configurable digital filter for external clock) */
#define  LPTIM_CFGR_CKFLT_0                     ((uint32_t)0x00000008)             /*!< Bit 0 */
#define  LPTIM_CFGR_CKFLT_1                     ((uint32_t)0x00000010)             /*!< Bit 1 */

#define  LPTIM_CFGR_TRGFLT                      ((uint32_t)0x000000C0)             /*!< TRGFLT[1:0] bits (Configurable digital filter for trigger) */
#define  LPTIM_CFGR_TRGFLT_0                    ((uint32_t)0x00000040)             /*!< Bit 0 */
#define  LPTIM_CFGR_TRGFLT_1                    ((uint32_t)0x00000080)             /*!< Bit 1 */

#define  LPTIM_CFGR_PRESC                       ((uint32_t)0x00000E00)             /*!< PRESC[2:0] bits (Clock prescaler) */
#define  LPTIM_CFGR_PRESC_0                     ((uint32_t)0x00000200)             /*!< Bit 0 */
#define  LPTIM_CFGR_PRESC_1                     ((uint32_t)0x00000400)             /*!< Bit 1 */
#define  LPTIM_CFGR_PRESC_2                     ((uint32_t)0x00000800)             /*!< Bit 2 */

#define  LPTIM_CFGR_TRIGSEL                     ((uint32_t)0x0000E000)             /*!< TRIGSEL[2:0]] bits (Trigger selector) */
#define  LPTIM_CFGR_TRIGSEL_0                   ((uint32_t)0x00002000)             /*!< Bit 0 */
#define  LPTIM_CFGR_TRIGSEL_1                   ((uint32_t)0x00004000)             /*!< Bit 1 */
#define  LPTIM_CFGR_TRIGSEL_2                   ((uint32_t)0x00008000)             /*!< Bit 2 */

#define  LPTIM_CFGR_TRIGEN                      ((uint32_t)0x00060000)             /*!< TRIGEN[1:0] bits (Trigger enable and polarity) */
#define  LPTIM_CFGR_TRIGEN_0                    ((uint32_t)0x00020000)             /*!< Bit 0 */
#define  LPTIM_CFGR_TRIGEN_1                    ((uint32_t)0x00040000)             /*!< Bit 1 */

#define  LPTIM_CFGR_TIMOUT                      ((uint32_t)0x00080000)             /*!< Timout enable */
#define  LPTIM_CFGR_WAVE                        ((uint32_t)0x00100000)             /*!< Waveform shape */
#define  LPTIM_CFGR_WAVPOL                      ((uint32_t)0x00200000)             /*!< Waveform shape polarity */
#define  LPTIM_CFGR_PRELOAD                     ((uint32_t)0x00400000)             /*!< Reg update mode */
#define  LPTIM_CFGR_COUNTMODE                   ((uint32_t)0x00800000)             /*!< Counter mode enable */
#define  LPTIM_CFGR_ENC                         ((uint32_t)0x01000000)             /*!< Encoder mode enable */

/******************  Bit definition for LPTIM_CR register  ********************/
#define  LPTIM_CR_ENABLE                        ((uint32_t)0x00000001)             /*!< LPTIMer enable */
#define  LPTIM_CR_SNGSTRT                       ((uint32_t)0x00080002)             /*!< Timer start in single mode */
#define  LPTIM_CR_CNTSTRT                       ((uint32_t)0x00000004)             /*!< Timer start in continuous mode */

/******************  Bit definition for LPTIM_CMP register  *******************/
#define  LPTIM_CMP_CMP                          ((uint32_t)0x0000FFFF)             /*!< Compare register */

/******************  Bit definition for LPTIM_ARR register  *******************/
#define  LPTIM_ARR_ARR                          ((uint32_t)0x0000FFFF)             /*!< Auto reload register */

/******************  Bit definition for LPTIM_CNT register  *******************/
#define  LPTIM_CNT_CNT                          ((uint32_t)0x0000FFFF)             /*!< Counter register */

/******************  Bit definition for LPTIM_OR register  *******************/
#define  LPTIM_OR_OR                           ((uint32_t)0x00000003)               /*!< LPTIMER[1:0] bits (Remap selection) */
#define  LPTIM_OR_OR_0                         ((uint32_t)0x00000001)               /*!< Bit 0 */
#define  LPTIM_OR_OR_1                         ((uint32_t)0x00000002)               /*!< Bit 1 */

/******************************************************************************/
/*                                                                            */
/*                      Analog Comparators (COMP)                             */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for COMP_SR register  ********************/
#define  COMP_SR_C1VAL                         ((uint32_t)0x00000001)     
#define  COMP_SR_C2VAL                         ((uint32_t)0x00000002)    
#define  COMP_SR_C1IF                          ((uint32_t)0x00010000) 
#define  COMP_SR_C2IF                          ((uint32_t)0x00020000)    
/*******************  Bit definition for COMP_ICFR register  ********************/
#define  COMP_ICFR_C1IF                        ((uint32_t)0x00010000)     
#define  COMP_ICFR_C2IF                        ((uint32_t)0x00020000)     
/*******************  Bit definition for COMP_OR register  ********************/
#define  COMP_OR_AFOPA6                        ((uint32_t)0x00000001)     
#define  COMP_OR_AFOPA8                        ((uint32_t)0x00000002)     
#define  COMP_OR_AFOPB12                       ((uint32_t)0x00000004)    
#define  COMP_OR_AFOPE6                        ((uint32_t)0x00000008)     
#define  COMP_OR_AFOPE15                       ((uint32_t)0x00000010)     
#define  COMP_OR_AFOPI1                        ((uint32_t)0x00000020)     
#define  COMP_OR_AFOPI4                        ((uint32_t)0x00000020)    

/*!< ******************  Bit definition for COMP_CFGRx register  ********************/
#define  COMP_CFGRx_EN                         ((uint32_t)0x00000001)     /*!< COMPx enable bit                     */
#define  COMP_CFGRx_BRGEN                      ((uint32_t)0x00000002)     /*!< COMPx Scaler bridge enable           */
#define  COMP_CFGRx_SCALEN                     ((uint32_t)0x00000004)     /*!< COMPx Voltage scaler enable bit      */
#define  COMP_CFGRx_POLARITY                   ((uint32_t)0x00000008)     /*!< COMPx  polarity selection bit        */
#define  COMP_CFGRx_WINMODE                    ((uint32_t)0x00000010)     /*!< COMPx Windows mode selection bit     */
#define  COMP_CFGRx_ITEN                       ((uint32_t)0x00000040)     /*!< COMPx  interrupt enable              */
#define  COMP_CFGRx_HYST                       ((uint32_t)0x00000300)     /*!< COMPx  hysteresis selection bits     */
#define  COMP_CFGRx_HYST_0                     ((uint32_t)0x00000100)     /*!< COMPx  hysteresis selection bit 0    */
#define  COMP_CFGRx_HYST_1                     ((uint32_t)0x00000200)     /*!< COMPx  hysteresis selection bit 1    */
#define  COMP_CFGRx_PWRMODE                    ((uint32_t)0x00003000)     /*!< COMPx Power Mode of the comparator   */
#define  COMP_CFGRx_PWRMODE_0                  ((uint32_t)0x00001000)     /*!< COMPx  Power Mode selection bit 0    */
#define  COMP_CFGRx_PWRMODE_1                  ((uint32_t)0x00002000)     /*!< COMPx  Power Mode selection bit 1    */
#define  COMP_CFGRx_INMSEL                     ((uint32_t)0x00070000)     /*!< COMPx  input minus selection bit  */
#define  COMP_CFGRx_INMSEL_0                   ((uint32_t)0x00010000)     /*!< COMPx inverting input selection bit 0 */
#define  COMP_CFGRx_INMSEL_1                   ((uint32_t)0x00020000)     /*!< COMPx inverting input selection bit 1 */
#define  COMP_CFGRx_INMSEL_2                   ((uint32_t)0x00040000)     /*!< COMPx inverting input selection bit 2 */
#define  COMP_CFGRx_INPSEL                     ((uint32_t)0x00100000)     /*!< COMPx  input plus selection bit       */
#define  COMP_CFGRx_BLANKING                   ((uint32_t)0x0F000000)     /*!< COMPx  blanking source selection bits */
#define  COMP_CFGRx_LOCK                       ((uint32_t)0x80000000)     /*!< COMPx Lock Bit                        */

/******************************************************************************/
/*                                                                            */
/*                         Operational Amplifier (OPAMP)                      */
/*                                                                            */
/******************************************************************************/
/*********************  Bit definition for OPAMP1_CSR register  ***************/
#define OPAMP1_CSR_OPAEN               ((uint32_t)0x00000001) /*!< Operational amplifier1 Enable */
#define OPAMP1_CSR_OPALPM              ((uint32_t)0x00000002) /*!< Operational amplifier1 Low Power Mode */

#define OPAMP1_CSR_OPAMODE             ((uint32_t)0x0000000C) /*!< Operational amplifier1 PGA mode */
#define OPAMP1_CSR_OPAMODE_0           ((uint32_t)0x00000004) /*!< Bit 0 */
#define OPAMP1_CSR_OPAMODE_1           ((uint32_t)0x00000008) /*!< Bit 1 */

